{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 102,
   "id": "35d1f7dc-7a6f-4043-a83e-0519857b6a41",
   "metadata": {},
   "outputs": [],
   "source": [
    "import configparser\n",
    "config = configparser.ConfigParser()\n",
    "config.read('../training/secrets.ini')\n",
    "import os\n",
    "import openai\n",
    "os.environ.update({'OPENAI_API_KEY': config['OPENAI']['OPENAI_API_KEY']})\n",
    "openai.api_key = os.getenv('OPENAI_API_KEY')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 103,
   "id": "717c666b-57e6-41be-bf22-b0dc03c1de1a",
   "metadata": {},
   "outputs": [],
   "source": [
    "system_prompt_template= \"\"\"\n",
    "You are an expert on sparql and wikibase. I have a private wikibase where the p and q items are completely unknown to you. \n",
    "\n",
    "If you are asked to provide a \"query template json\" for a user question, you should respond with a json object with these keys and values:\n",
    "* 'query_template': a python-style template string. the query template should not use 'rdfs:label' to help you find items. Instead, just use a placeholder tag for each p and q item you need. Each tag should begin with \"p-\" or \"q-\" depending on whether you think you need a p or a q item\n",
    "* 'vocabulary': a list of objects, one for each p or q item you need for a sparql query, each item should have these components:\n",
    "** 'item_tag': a placeholder string that you make up\n",
    "** 'item_label_quesses': a list of up to three different strings that you think might be used as the label for that p or q item\n",
    "Remember: you do not know the actual q or p items in my wikibase, so make sure to list ALL p and q items in the 'vocabulary' section of the json.\n",
    "\n",
    "You may assume the following prefixes:\n",
    "PREFIX wd: <http://www.wikidata.org/entity/>\n",
    "PREFIX wdt: <http://www.wikidata.org/prop/direct/>\n",
    "PREFIX p: <http://www.wikidata.org/prop/>\n",
    "PREFIX ps: <http://www.wikidata.org/prop/statement/>\n",
    "\n",
    "Respond only with the json. Do not include any comments or explanations.\n",
    "\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 104,
   "id": "bf21e8ce-f30c-40c3-b9c1-eccd82e191b4",
   "metadata": {
    "tags": []
   },
   "outputs": [],
   "source": [
    "example1_human = \"\"\"\n",
    "generate a query template json for the question \"Does malin 1 have a right ascension lower than 15.1398?\"\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 105,
   "id": "f6ca08ea-b89a-429f-a1b9-9cc64235475b",
   "metadata": {},
   "outputs": [],
   "source": [
    "example1_ai = \"\"\"\n",
    "{{\n",
    "  \"query_template\": \"SELECT ?result WHERE {{ wd:q-Malin1 wdt:p-RightAscension ?right_ascension . FILTER(?right_ascension < 15.1398) BIND(xsd:boolean(?right_ascension < 15.1398) as ?result) }}\",\n",
    "  \"vocabulary\": [\n",
    "    {{\n",
    "      \"item_tag\": \"q-Malin1\",\n",
    "      \"item_label_quesses\": [\"Malin 1\", \"Malin-1\", \"Malin1\"]\n",
    "    }},\n",
    "    {{\n",
    "      \"item_tag\": \"p-RightAscension\",\n",
    "      \"item_label_quesses\": [\"Right ascension\", \"right_ascension\", \"RA\"]\n",
    "    }}\n",
    "  ]\n",
    "}}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 106,
   "id": "d4141bcf-5859-41ff-972e-6a1403889fff",
   "metadata": {},
   "outputs": [],
   "source": [
    "example2_human = \"\"\"\n",
    "How many children did J.S. Bach have?\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 107,
   "id": "363ac6fd-184e-421e-bb14-40aab05db8cd",
   "metadata": {},
   "outputs": [],
   "source": [
    "example2_ai = \"\"\"\n",
    "{{\n",
    "  \"query_template\": \"w\n",
    "  \"vocabulary\": [\n",
    "    {{\n",
    "      \"item_tag\": \"q-JSBach\",\n",
    "      \"item_label_quesses\": [\"Johann Sebastian Bach\", \"Bach, Johann Sebastian\", \"J.S. Bach\"]\n",
    "    }},\n",
    "    {{\n",
    "      \"item_tag\": \"p-Child\",\n",
    "      \"item_label_quesses\": [\"Child\", \"Offspring\", \"Progeny\"]\n",
    "    }}\n",
    "  ]\n",
    "}}\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 108,
   "id": "c4c97c3d-da72-4178-b2a6-5dd5e51cb274",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.prompts import (\n",
    "    ChatPromptTemplate,\n",
    "    PromptTemplate,\n",
    "    SystemMessagePromptTemplate,\n",
    "    AIMessagePromptTemplate,\n",
    "    HumanMessagePromptTemplate,\n",
    ")\n",
    "from langchain.schema import (\n",
    "    AIMessage,\n",
    "    HumanMessage,\n",
    "    SystemMessage\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 109,
   "id": "d2c66258-4ef2-4984-b485-6f782bb48b92",
   "metadata": {},
   "outputs": [],
   "source": [
    "template=system_prompt_template\n",
    "system_message_prompt = SystemMessagePromptTemplate.from_template(template)\n",
    "\n",
    "example_human_1 = HumanMessagePromptTemplate.from_template(example1_human)\n",
    "example_ai_1 = AIMessagePromptTemplate.from_template(example1_ai)\n",
    "example_human_2 = HumanMessagePromptTemplate.from_template(example2_human)\n",
    "example_ai_2 = AIMessagePromptTemplate.from_template(example2_ai)\n",
    "\n",
    "human_template=\"Please generate query template json for this question: {text}\"\n",
    "human_message_prompt = HumanMessagePromptTemplate.from_template(human_template)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 110,
   "id": "3adbf289-8fd4-4a46-aca7-59d7159888c3",
   "metadata": {},
   "outputs": [],
   "source": [
    "from langchain.chat_models import ChatOpenAI\n",
    "chat = ChatOpenAI(temperature=0)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 111,
   "id": "20352840-7cb8-4a17-b35a-702cea2226ce",
   "metadata": {},
   "outputs": [],
   "source": [
    "chat_prompt = ChatPromptTemplate.from_messages([system_message_prompt, example_human_1, example_ai_1, example_human_2, example_ai_2, human_message_prompt])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 112,
   "id": "9bfb848e-720c-4908-bdfb-bf000471c279",
   "metadata": {},
   "outputs": [
    {
     "name": "stderr",
     "output_type": "stream",
     "text": [
      "WARNING:/opt/homebrew/anaconda3/envs/conda210/lib/python3.9/site-packages/langchain/chat_models/openai.py:Retrying langchain.chat_models.openai.ChatOpenAI.completion_with_retry.<locals>._completion_with_retry in 4.0 seconds as it raised APIConnectionError: Error communicating with OpenAI: ('Connection aborted.', ConnectionResetError(54, 'Connection reset by peer')).\n"
     ]
    },
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{\n",
      "  \"query_template\": \"SELECT ?player_id WHERE { wd:q-HakeemOlajuwon wdt:p-BasketballReferencecomNBAPlayerID ?player_id . }\",\n",
      "  \"vocabulary\": [\n",
      "    {\n",
      "      \"item_tag\": \"q-HakeemOlajuwon\",\n",
      "      \"item_label_quesses\": [\"Hakeem Olajuwon\", \"Olajuwon, Hakeem\"]\n",
      "    },\n",
      "    {\n",
      "      \"item_tag\": \"p-BasketballReferencecomNBAPlayerID\",\n",
      "      \"item_label_quesses\": [\"Basketball-Reference.com NBA player ID\", \"BasketballReference.com NBA Player ID\", \"Basketball-Reference NBA player ID\"]\n",
      "    }\n",
      "  ]\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "from langchain import PromptTemplate, LLMChain\n",
    "chain = LLMChain(llm=chat, prompt=chat_prompt)\n",
    "result = chain.run('Which is the Basketball-Reference.com NBA player ID of Hakeem Olajuwon?')\n",
    "print(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "0a445ea1-87a3-42fc-be8c-923356c79b77",
   "metadata": {},
   "outputs": [],
   "source": [
    "import json"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "82e3c719-0455-4781-b836-a08349bc77f2",
   "metadata": {},
   "outputs": [],
   "source": [
    "query_template = json.loads(result)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "7265440e-fbb3-4c22-8b72-f83f46c8f36e",
   "metadata": {},
   "outputs": [],
   "source": [
    "from typing import Any, Dict, List, Optional, Union\n",
    "\n",
    "def get_nested_value(nested_dict: Dict[str, Any], path: List[str]) -> Optional[Any]:\n",
    "    \"\"\"\n",
    "    Retrieves a value from a nested dictionary structure using a list of keys as a path.\n",
    "\n",
    "    :param nested_dict: The nested dictionary structure to traverse.\n",
    "    :param path: A list of strings representing the keys to traverse in order to access the desired value.\n",
    "    :return: The value at the end of the path if it exists, or None if any key in the path is not found.\n",
    "    \"\"\"\n",
    "    current = nested_dict\n",
    "    for key in path:\n",
    "        if not isinstance(current, dict) or key not in current:\n",
    "            return None\n",
    "        current = current[key]\n",
    "    return current"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "0bd1cb13-3b79-46f6-bab7-a1b55e2b9373",
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "from typing import Optional\n",
    "\n",
    "def vocab_lookup(search: str, entity_type: str = \"item\",\n",
    "                 item_tag: str = None, \n",
    "                 srqiprofile: str = \"classic\") -> Optional[str]:\n",
    "    \n",
    "    if item_tag is not None:\n",
    "        if item_tag.startswith(\"q-\"):\n",
    "            entity_type = \"item\"\n",
    "        elif item_tag.startswith(\"p-\"):\n",
    "            entity_type = \"property\"   \n",
    "    \n",
    "    if entity_type == \"item\":\n",
    "        srnamespace = 0\n",
    "    elif entity_type == \"property\":\n",
    "        srnamespace = 120\n",
    "    else:\n",
    "        raise ValueError(\"entity_type must be either 'property' or 'item'\")      \n",
    "        \n",
    "    url = \"https://www.wikidata.org/w/api.php\"\n",
    "    params = {\n",
    "        \"action\": \"query\",\n",
    "        \"list\": \"search\",\n",
    "        \"srsearch\": search,\n",
    "        \"srnamespace\": srnamespace,\n",
    "        \"srlimit\": 5,\n",
    "        \"srqiprofile\": srqiprofile,\n",
    "        \"format\": \"json\"\n",
    "    }\n",
    "    headers = {'Accept': 'application/json'}\n",
    "\n",
    "    response = requests.get(url, headers=headers, params=params)\n",
    "        \n",
    "    if response.status_code == 200:\n",
    "        results = get_nested_value(response.json(), ['query', 'search'])\n",
    "        if results and len(results) > 0:\n",
    "            title = results[0]['title']\n",
    "            # properties are returned with a prefix 'property:'\n",
    "            return results[0]['title'].split(':')[-1]\n",
    "        else:\n",
    "            print(f\"No {entity_type} found for '{search}'\")\n",
    "            return \"\"\n",
    "    else:\n",
    "        print(f\"Request failed with status code {response.status_code}\")\n",
    "        return \"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 99,
   "id": "0857e524-dca3-44ac-a77e-b317b1de88e5",
   "metadata": {},
   "outputs": [],
   "source": [
    "def resolve_query_template(t):\n",
    "    vocab_items = [(v[\"item_tag\"], v[\"item_label_quesses\"]) for v in t[\"vocabulary\"]]\n",
    "    # since this is not a proper template, we use \"replace\" below\n",
    "    # so we need to be careful that some tags may be prefixes of others\n",
    "    # sorting them by tag length avoids that\n",
    "    vocab_items = sorted(vocab_items, key=lambda x: x[0], reverse=True)\n",
    "    resolved_vocabulary = {item_tag: vocab_lookup(item_label_quesses[0], item_tag=item_tag) for item_tag, item_label_quesses in vocab_items}\n",
    "    query = t['query_template']\n",
    "    for item_tag, item_id in resolved_vocabulary.items():\n",
    "        query = query.replace(item_tag, item_id)\n",
    "    result = query\n",
    "    return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "320a464d-b540-4cd0-9132-0df48bb4e8d5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'SELECT ?player_id WHERE { wd:Q273256 wdt:P2685 ?player_id . }'"
      ]
     },
     "execution_count": 17,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "resolve_query_template(query_template)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "cf31fe60-219b-4d66-9686-4d76eb38c666",
   "metadata": {},
   "outputs": [],
   "source": [
    "def translator(question):\n",
    "    llm_result = chain.run(question)\n",
    "    try:\n",
    "        query_template = json.loads(llm_result)\n",
    "    except Exception:\n",
    "        query_template = \"\" \n",
    "    query = resolve_query_template(query_template)\n",
    "    return query\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "904eb61c-cc48-4f44-b6cf-2454f462030a",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "'SELECT (COUNT(?team) as ?result) WHERE { wd:Q1422 wdt:P1923 ?team }'"
      ]
     },
     "execution_count": 19,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "translator(\"The Juventus F.C. has what number of participating teams?\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "94b13a2a-b67f-4e4a-8ded-ff384aabaec2",
   "metadata": {},
   "source": [
    "# Validation testing for Natural Language Question to SPARQL Query"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "8ff2579b-1237-41b2-8e02-c27593712dc4",
   "metadata": {},
   "source": [
    "Create a df for the lcquad queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "ba4c75d4-1fea-4b3d-a928-f572397ba45d",
   "metadata": {},
   "outputs": [],
   "source": [
    "import pandas as pd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "886ad3ea-6071-40c7-b269-f1881280d970",
   "metadata": {},
   "outputs": [],
   "source": [
    "lcquad_path = \"../../lcquad2.0.train.json\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "6a7f536a-1a41-4727-9132-240b8a5edcb9",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "-rw-r--r--@ 1 i857913  staff  26561843 Feb  6 16:58 ../../lcquad2.0.train.json\n"
     ]
    }
   ],
   "source": [
    "!ls -l {lcquad_path}"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "id": "4dc099c2-ea57-47ac-9167-41b1a2ab4ff0",
   "metadata": {},
   "outputs": [],
   "source": [
    "lcquad_df = pd.read_json(lcquad_path)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "8eb2eb73-5c48-4590-98bb-a4b9b995adca",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "24180"
      ]
     },
     "execution_count": 24,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(lcquad_df)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "db545990-0e20-4fd9-ac2b-d7781625f8d8",
   "metadata": {},
   "source": [
    "Make a sparql runner"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 25,
   "id": "61624c3d-940d-4eae-afbb-1c5d01a856ca",
   "metadata": {},
   "outputs": [],
   "source": [
    "from wikibaseintegrator import wbi_helpers\n",
    "from wikibaseintegrator.wbi_config import config as wbi_config\n",
    "import logging"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 26,
   "id": "b960e274-9550-42d7-b0e4-d83b1b806fd8",
   "metadata": {},
   "outputs": [],
   "source": [
    "wbi_config['USER_AGENT'] = 'AskwikiBot/1.0 (https://www.wikidata.org/wiki/User:What_Tottles_Meant)'\n",
    "wbi_config['BACKOFF_MAX_TRIES'] = 1\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 57,
   "id": "3cd32311-0301-4c8a-b063-b08b9df109e3",
   "metadata": {},
   "outputs": [],
   "source": [
    "from requests.exceptions import HTTPError\n",
    "\n",
    "def run_sparql(query):\n",
    "    try:\n",
    "        results = wbi_helpers.execute_sparql_query(query)\n",
    "    except HTTPError as he:\n",
    "        logging.error(f'HTTPError {he}')\n",
    "        print(f\"failed query {query}\")\n",
    "        return None\n",
    "    # print(results)\n",
    "    if 'boolean' in results:\n",
    "        return pd.DataFrame([{'Boolean': results['boolean'] }])\n",
    "    jsonResult = [dict([(k, b[k]['value']) for k in b]) for b in results['results']['bindings']]\n",
    "    df = pd.DataFrame.from_dict(jsonResult)\n",
    "    return df\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 67,
   "id": "657738fc-68eb-4660-aa2b-92a0eb3aa7d0",
   "metadata": {},
   "outputs": [],
   "source": [
    "import requests\n",
    "from typing import List, Dict, Any\n",
    "\n",
    "def run_sparql(query: str) -> List[Dict[str, Any]]:\n",
    "    url = 'https://query.wikidata.org/sparql'\n",
    "    headers = {\n",
    "        'Accept': 'application/json',\n",
    "        'User-Agent': 'AskwikiBot/1.0 (https://www.wikidata.org/wiki/User:What_Tottles_Meant)'\n",
    "    }\n",
    "\n",
    "    response = requests.get(url, headers=headers, params={'query': query, 'format': 'json'})\n",
    "\n",
    "    if response.status_code == 200:\n",
    "        results = response.json().get('results', {}).get('bindings', [])\n",
    "        return results\n",
    "    else:\n",
    "        print(f\"Request failed with status code {response.status_code}\")\n",
    "        return None\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 68,
   "id": "63f84d50-a2ef-4178-9d88-cd945e763ab6",
   "metadata": {},
   "outputs": [],
   "source": [
    "import time\n",
    "def validate_queries(qs):\n",
    "    validation_results = []\n",
    "    count = 0\n",
    "    for q in qs:\n",
    "        print(count)\n",
    "        if not 'limit' in q.lower():\n",
    "            q += ' limit 100'\n",
    "        print(q)\n",
    "        df = run_sparql(q)\n",
    "        result_count = 0\n",
    "        if df is None:\n",
    "            run_result = 'Fail'\n",
    "            print(f\"Failed query number {count}\")\n",
    "        else:\n",
    "            run_result = 'Pass'\n",
    "            result_count = len(df)\n",
    "        validation_results.append((run_result, result_count))\n",
    "        count += 1\n",
    "        time.sleep(2)\n",
    "    return validation_results "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 69,
   "id": "f67a35a0-915e-4db8-93fe-90d32618bbb3",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n",
      " select distinct ?obj where { wd:Q188920 wdt:P2813 ?obj . ?obj wdt:P31 wd:Q1002697 }  limit 100\n",
      "1\n",
      "SELECT ?answer WHERE { wd:Q169794 wdt:P26 ?X . ?X wdt:P22 ?answer} limit 100\n",
      "2\n",
      "ASK WHERE { wd:Q174843 wdt:P106 wd:Q1804811 . wd:Q174843 wdt:P106 wd:Q33231 } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 2\n",
      "3\n",
      "SELECT ?answer WHERE { wd:Q675176 wdt:P515 ?X . ?X wdt:P156 ?answer} limit 100\n",
      "4\n",
      "select distinct ?answer where { wd:Q32491 wdt:P3362 ?answer} limit 100\n",
      "5\n",
      "SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q134041 . ?sbj rdfs:label ?sbj_label . FILTER(STRSTARTS(lcase(?sbj_label), 'p')) . FILTER (lang(?sbj_label) = 'en') } LIMIT 25 \n"
     ]
    }
   ],
   "source": [
    "v = validate_queries(lcquad_df['sparql_wikidata'].loc[0:5])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "2c4e62f0-9a38-4db1-bcc2-41ede86d669b",
   "metadata": {},
   "outputs": [],
   "source": [
    "v_df = pd.DataFrame(v)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "41aab68f-a909-4435-bdc3-a54c9310a257",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "5"
      ]
     },
     "execution_count": 31,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(v_df[v_df[0] == 'Pass'])"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "82d44f81-0359-4e1b-b1eb-db1f3c86b601",
   "metadata": {},
   "source": [
    "    \n",
    "## Validate the queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "52fd2e83-34d9-43bf-9c88-2adfe3bde247",
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_sparql(question):\n",
    "    sparql = translator(f\"translate English to SPARQL: {question}\")\n",
    "    logging.info(f'sparql {sparql}')\n",
    "    return sparql\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 33,
   "id": "d06ccf51-e8b3-43f7-9a36-2087b8e5c15c",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "\"SELECT ?type (COUNT(?disease) AS ?count) WHERE { ?disease wdt:P31 ?type . ?disease rdfs:label ?label . FILTER(LANG(?label) = 'en') FILTER(CONTAINS(LCASE(?label), 'liver infection')) } GROUP BY ?type ORDER BY DESC(?count) LIMIT 10\""
      ]
     },
     "execution_count": 33,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "generate_sparql('What are the most common types of liver infection')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "id": "92be221e-e0c3-4da6-bc38-2cebd91ab21d",
   "metadata": {},
   "outputs": [],
   "source": [
    "def generate_lots_of_sparql(l):\n",
    "    result = []\n",
    "    count = 0\n",
    "    for s in l:\n",
    "        # if count % 10 == 0:\n",
    "        print(s) \n",
    "        print(count)\n",
    "        try:\n",
    "            sp = generate_sparql(s)\n",
    "        except Exception:\n",
    "            sp = \"\"\n",
    "        result.append(sp)\n",
    "        count += 1\n",
    "    print(count)\n",
    "    return result\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "id": "636dc58f-6bc9-421b-8dc6-4e08b9e69962",
   "metadata": {
    "collapsed": true,
    "jupyter": {
     "outputs_hidden": true
    },
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Which country has highest individual tax rate?\n",
      "0\n",
      "When did James Thomas Farrell receive the St. Louis Literary Award?\n",
      "1\n",
      "When was Pablo Picasso's partnership with Fernade Oliver over?\n",
      "2\n",
      "What is the product with the lowest consumption rate per capita whose has part is paraffin wax?\n",
      "3\n",
      "No item found for 'bd:serviceParam'\n",
      "What are the coordinates for the geographic center of Michigan, as determined by the center of gravity of the surface?\n",
      "4\n",
      "Is the life expectancy of Indonesia 55.3528?\n",
      "5\n",
      "When did Emmerson Mnangagwa begin going to the University of Zambia?\n",
      "6\n",
      "What kind of career does Grigori Kozintsev have in the screenwriting field?\n",
      "7\n",
      "what is hypothetical protein ecia139-4120 habitat of found in species?\n",
      "8\n",
      "What sovereign state replaced the Kingdom of Great Britain?\n",
      "9\n",
      "Of the century breaks of the Colm Gilcreest equal less than 9.6?\n",
      "10\n",
      "In which country the Golden Horde used to live ?\n",
      "11\n",
      "Located in the Central District, what is the county seat whose twin cities include Feodosiya?\n",
      "12\n",
      "No item found for ''\n",
      "When did Nicaragua count a population of 3.87732e+06 inhabitants?\n",
      "13\n",
      "What does emigration mean?\n",
      "14\n",
      "Which is the meta-organization that is regulated by the football association?\n",
      "15\n",
      "When was the spouse divorced Nero in 9-6-68\n",
      "16\n",
      "n/a\n",
      "17\n",
      "Former champion Francisco Alarcon gave what award to Art Spiegelaman?\n",
      "18\n",
      "No property found for 'Former champion'\n",
      "Are there more than 0 survivors of the Charkhi Dadri mid-air collision\n",
      "19\n",
      "When did Secretariat receive the Triple Crown Trophy?\n",
      "20\n",
      "Which borders of borders of Riverside have a start date of 1984-0-0?\n",
      "21\n",
      "Which is the facility of the defensive wall?\n",
      "22\n",
      "What is  in the IHO Hydrographic Dictionary (S-32) Number of lighthouse ?\n",
      "23\n",
      "Which is the fictional analog of Hippocampus?\n",
      "24\n",
      "What is a cause of death that begins with the letter \"p\" and can be found on a CT scan?\n",
      "25\n",
      "What is established by Archbishop of Canterbury, who is a male?\n",
      "26\n",
      "In what area is Fernandel buried at the Passy Cemetery?\n",
      "27\n",
      "Name the naval artillery wirh the smallest firing range?\n",
      "28\n",
      "What is the name of a Cayenne Pepper that also has dates?\n",
      "29\n",
      "Is the throughput of the Vest-vassdraget equal to 2697.672?\n",
      "30\n",
      "What method did the census use to determine the population of Taguig?\n",
      "31\n",
      "What award did Olga Tokarczuk receive in 2015?\n",
      "32\n",
      "What is Porky Pig in right now?\n",
      "33\n",
      "When did publisher of Pac-Man and place of publication?\n",
      "34\n",
      "Was Aleister Crowley educated at Trinity College and Eton College?\n",
      "35\n",
      "What is {located next to Quincy,} in the {novel, Infinite Jest}?\n",
      "36\n",
      "Who awarded Eric Hobsbawm an honorary doctorate?\n",
      "37\n",
      "What was the last team Allan Border belonged to in the year 1980?\n",
      "38\n",
      "Give me a film character from a fictional universe, such as Marvel comics that starts with a W.\n",
      "39\n",
      "Mention the fictional universe described or included in The Matrix.\n",
      "40\n",
      "What is {award received} of {Hans Krebs} where {point in time} is {1966-0-0} ?\n",
      "41\n",
      "Which record label signed Janet Jackson?\n",
      "42\n",
      "What is Tanzania's total reserves?\n",
      "43\n",
      "Does the slope rating of the Merion Golf Club equal 149\n",
      "44\n",
      "What is the density of hydrogen peroxide at a temperature of 20.0?\n",
      "45\n",
      "who architecture firm of home field of new york centaurs?\n",
      "46\n",
      "Which { meansseason starts} in {February} ?\n",
      "47\n",
      "Who is {champ} of {prize awarded} {Lily Tomlin} ?\n",
      "48\n",
      "What is the ammunition of the weapon, that has been used in the war in Southeast Asia?\n",
      "49\n",
      "Tell me every horse breed whose name starts with the letter z\n",
      "50\n",
      "The University of Florida is a member of which coalition?\n",
      "51\n",
      "Who is the brother in law of the writer Quran?\n",
      "52\n",
      "What is the New Zealand Gazetteer place id for Auckland?\n",
      "53\n",
      "What does the painting Grade Odalisque represent which has DRTL backwards?\n",
      "54\n",
      "Name an empire that contains the word \"british\" in its name\n",
      "55\n",
      "What is the instance of Antonio da Correggio whose date of birth is 1489-8-1?\n",
      "56\n",
      "Who was the teacher that supervised Shigeno Yasutsugu?\n",
      "57\n",
      "What is the SANDRE ID for Rhine?\n",
      "58\n",
      "When did Kylie Minogue receive the Gold Logie Award for Most Popular Personality on Australian Television?\n",
      "59\n",
      "What business does Alexander McQueen have?\n",
      "60\n",
      "Tell me the Greek deity of sibling of Zeus and that contains the word poseidon in it's name?\n",
      "61\n",
      "Who organizes the order of Ultima III: Exodus?\n",
      "62\n",
      "Who was the lead actor for the movie Deadpool?\n",
      "63\n",
      "Mention the musical related work highlighting the work of Sasha Grey.\n",
      "64\n",
      "What award did John de Mol receive in 2011?\n",
      "65\n",
      "Is the total fertility rate of Algeria greater than 3.4284?\n",
      "66\n",
      "When will the pressure and temperature of water reach the triple point stage?\n",
      "67\n",
      "Tell me physical phenomenon whose name has the word surface in it.\n",
      "68\n",
      "where does Vladimir putin reside?\n",
      "69\n",
      "Which is the municipality of Belgium that has the headquarters location of European Union?\n",
      "70\n",
      "Which is made from the goat meat having a common name as Domestic Goat?\n",
      "71\n",
      "What is located on terrain feature of Multonmah Falls?\n",
      "72\n",
      "No item found for 'Multonmah Falls'\n",
      "Stonewall Jackson commanded what battle?\n",
      "73\n",
      "Mention the temperature and the state of the matter of water upon achieving the critical point\n",
      "74\n",
      "which is the point time for syria has population as 8.08815e+06?\n",
      "75\n",
      "Does marketing involve Human communication, and packaging and labeling?\n",
      "76\n",
      "No property found for 'Involves'\n",
      "WHICH IS THE STAGE RACE WITH THE MAXIMUM FREQUENCY OF EVENT\n",
      "77\n",
      "WHICH IS THE AUSTRIAN MUNICIPALITY KEY OF  KLAGENFURT\n",
      "78\n",
      "Tell me the autonomous region of the People's Republic of China which contains the word xinjiang in it's name?\n",
      "79\n",
      "What is the Velká pardubická with the lowest race time whose winner is Peter Gehm?\n",
      "80\n",
      "Who is the author of the Watchmen and what award did they receive?\n",
      "81\n",
      "n/a\n",
      "82\n",
      "Name a book written in Esperanto\n",
      "83\n",
      "What is the general manager of Bernard Hinault?\n",
      "84\n",
      "Name the FSK 12 rated 3D film with the highest cost ?\n",
      "85\n",
      "How many are interested in Daniel Dennett?\n",
      "86\n",
      "In 1996, what significant event happened in the administrative territorial entity of Bristol?\n",
      "87\n",
      "Where is the river source of the Rhine?\n",
      "88\n",
      "What was Cate Blanchett nominated for her work in I'm Not There?\n",
      "89\n",
      "Tell me the tower that is depicted as Tower of Babel and contains the word babel in it's name?\n",
      "90\n",
      "What position was held by Harold Macmillan in the 34th Parliament of the United Kingdom, when was he elected, and why did he leave?\n",
      "91\n",
      "is the maximum wavelength of sensitivity of the human eye equal to 700?\n",
      "92\n",
      "Where was the location of birth of Hermann Heinrich Gossen, that has Q48460 such that 2--4355126?\n",
      "93\n",
      "No item found for 'The location of birth of Hermann Heinrich Gossen'\n",
      "Who received the Nobel Prize in Literature after Mo Yan?\n",
      "94\n",
      "When did Eiji Toyoda win an award for his work in Order of Prince Henry?\n",
      "95\n",
      "When was Jimmy Wales employed as Bomis and when did he leave?\n",
      "96\n",
      "No property found for 'Employment history'\n",
      "Which is the author of afterword of Erich Fromm?\n",
      "97\n",
      "Who are worked for Michelle Wolf and its source location of group/organisation is located in New York City?\n",
      "98\n",
      "What are the unit of measurement which start with the letter visus\n",
      "99\n",
      "No item found for 'Has unit symbol'\n",
      "what was the publication date for iTunes which has software version as 12.7.5?\n",
      "100\n",
      "Dennis M. Ritchie designed which structured programming language?\n",
      "101\n",
      "What role does Mickey Mouse play in the creative work of Ben Sharpsteen?\n",
      "102\n",
      "What is the stock exchange for the ticker symbol 0700 in Tencent?\n",
      "103\n",
      "What are the head of state and the office held by head of state of the Soviet Union?\n",
      "104\n",
      "What is the name of award recieved for Dawn Fraser has participant of 1960 Summer Olympics ?\n",
      "105\n",
      "What is the parent organization for the International Court of Justice?\n",
      "106\n",
      "What is the beginning of Sarajevo's\n",
      "107\n",
      "What significant event in 1978-6-1 is Michelle Bachelet known for?\n",
      "108\n",
      "What is the solubility of methyl chloride in water?\n",
      "109\n",
      "No property found for 'Solubility in water'\n",
      "What five U.S. states does the Delaware River drain from?\n",
      "110\n",
      "None\n",
      "111\n",
      "Which birth language is Chizoba Ejike?\n",
      "112\n",
      "No item found for 'Chizoba Ejike'\n",
      "What is the ionization energy of the nicotine?\n",
      "113\n",
      "Is tuberculosis prevalent?\n",
      "114\n",
      "Who is {creators} of {language of the original work} {Star Trek Into Darkness} ?\n",
      "115\n",
      "Who is the spouse of Aaliyah and when did they divorce?\n",
      "116\n",
      "What is {inhabitants} {nationality} of {Leopold von Sacher-Masoch} ?\n",
      "117\n",
      "What is the affiliation building in Columbia University\n",
      "118\n",
      "What is the commune of France with the lowest population whose located in time zone is UTC+01:00?\n",
      "119\n",
      "What is the district of the city with the MAX(number of houses whose instance of is district of the city?\n",
      "120\n",
      "What is Bram Stoker's occupation and field of work and did he work in Dublin Castle?\n",
      "121\n",
      "How many seasons of Handball-Bundesliga are there?\n",
      "122\n",
      "\"What is place of residence of Wangari Maathai,that has inflation rate of consumer price index as 2.9?\"\n",
      "123\n",
      "Who is the child of Pompey and the mother, Mucia Tertia?\n",
      "124\n",
      "Name an alcoholic beverage that contains the word \"rum \" in its name\n",
      "125\n",
      "How many terminus are in Vienna\n",
      "126\n",
      "What is in the region of Paroo River, that divides into Ku-ring-gai Council?\n",
      "127\n",
      "No item found for 'Paroo River Region'\n",
      "What has been the ister city of Changchun since Aug 25th, 1992?\n",
      "128\n",
      "How many rivers and lakes are connected to Lake Urmia?\n",
      "129\n",
      "Tell me soil type whose name has the word vertisol in it.\n",
      "130\n",
      "What is Lizzy Yarnold's TheSports.org athlete ID?\n",
      "131\n",
      "What is { award received } from { Justin Timberlake } that is { point in time } is { 2007 - 0 - 0 }?\n",
      "132\n",
      "Which religious concept starts with the letter t\n",
      "133\n",
      "Is it true that the explosive energy equivalent of Father of All Bombs is less than 52.8?\n",
      "134\n",
      "When did child of Abigail Adams and date of birth?\n",
      "135\n",
      "Does the Becherovka alcohol by volume less than 30.4\n",
      "136\n",
      "What are the prefecture-level city  which start with the letter ürümqi\n",
      "137\n",
      "tell me ceremony whose name has the word umhlanga in it\n",
      "138\n",
      "Which is {played as} of {symbol} of {inequality} ?\n",
      "139\n",
      "What is edition runtime for League of Legends?\n",
      "140\n",
      "What is the name of the Dutch municipal coat of arms of Amsterdam?\n",
      "141\n",
      "No property found for 'municipal coat of arms'\n",
      "Which is the sauce that originated in Korea?\n",
      "142\n",
      "How many depositors are with the {United Nations Secretary-General} ?\n",
      "143\n",
      "No property found for 'Depositor'\n",
      "Which is the electric charge for antihydrogen?\n",
      "144\n",
      "Who gave the {is shown in} of {based upon} of {Clark Kent} ?\n",
      "145\n",
      "How far west are we?\n",
      "146\n",
      "Tell me national association football team whose name has the word team in it.\n",
      "147\n",
      "Tell me the most notable work of Christopher Hitchens and also the publisher.\n",
      "148\n",
      "What is the INSEE countries and foreign territories code for the Democratic Republic of Congo?\n",
      "149\n",
      "No item found for 'INSEE country code'\n",
      "What is the warheroes.ru ID for Yuri Gagarin?\n",
      "150\n",
      "Is the diameter pf nickel equal to 0.807?\n",
      "151\n",
      "Is the stated age of Rolf-Axel Eberhardt greater than 52?\n",
      "152\n",
      "When Podgorica started as Principality of Montenegro?\n",
      "153\n",
      "IS THE ENTHALPY OF VAPORIZATION OF METHANOL IS EQUAL TO 37400\n",
      "154\n",
      "What award was received Mary Tyler Moore ?\n",
      "155\n",
      "what is Tuesday named after?\n",
      "156\n",
      "How many of the archives are for Grace Hopper?\n",
      "157\n",
      "Which is the narrative location of Siddhartha?\n",
      "158\n",
      "Where is the place of Tartuffe's first performance with the farthest east coordinates of 48.8363848 2.4697602?\n",
      "159\n",
      "What are the military operation which start with the letter o\n",
      "160\n",
      "Is the matches/games drawn/tied of the 2001 British and Irish Lions tour to Australia equal to 0?\n",
      "161\n",
      "Who is the mother and husband of Candice Bergen?\n",
      "162\n",
      "\"Which language written from Romy Schneider, has the grammatical person speaking as the third personal plural?\"\n",
      "163\n",
      "Does the cash back of the Gold  ADAC Credit Card equals 5?\n",
      "164\n",
      "Who is the opposite of the superhero?\n",
      "165\n",
      "What is the use of playing World Rugby?\n",
      "166\n",
      "What is the current population of Aden?\n",
      "167\n",
      "what is spouse of Carlos Saura that is start time is 2006?\n",
      "168\n",
      "How many numbers of exclave for the  {Azerbaijan} ?\n",
      "169\n",
      "Which is the total equity of Micron Technology?\n",
      "170\n",
      "Was Michael J. Fox's place of birth in Edmonton?\n",
      "171\n",
      "What is Palace of Westminster's architect and heritage designation?\n",
      "172\n",
      "is it true that the SSK6-1s optimum viable temperature is greater than 24.0?\n",
      "173\n",
      "Which country housed the Indian Independence Movement?\n",
      "174\n",
      "No property found for 'Location of Indian Independence Movement'\n",
      "Name a nonmetal discovered in England  that starts with letter O\n",
      "175\n",
      "What did Sidney Crosby draft?\n",
      "176\n",
      "How many shogun military ranks are there?\n",
      "177\n",
      "No item found for 'shogun military rank'\n",
      "Who was presumably thought to be a student of Strabo?\n",
      "178\n",
      "What position did John Hume hold, when was he elected, and what position did he hold in the 53rd Parliament of the United Kingdom?\n",
      "179\n",
      "Who is the son of Jacob Conover?\n",
      "180\n",
      "Gordon Lightfoot was nominated for what at what time?\n",
      "181\n",
      "What is John X's persumed date of date according to sourcing circumstances?\n",
      "182\n",
      "No property found for 'Presumed date of death'\n",
      "Which is the patron saint of the place of death of Anna de' Medici?\n",
      "183\n",
      "Is it true that the fee of Harvard University is less than 90?\n",
      "184\n",
      "What is BIA PSY person ID for Carl Rogers ?\n",
      "185\n",
      "Who is the captain of F.C. Porto?\n",
      "186\n",
      "What are the autonomous region of the People's Republic of China which start with the letter X\n",
      "187\n",
      "What is the time zone that Marseille is located in?\n",
      "188\n",
      "What award did Harry Martinson adn Eyvind Johnson receive together?\n",
      "189\n",
      "Mention the headquarter location of the Russian Orthodox Church monastery.\n",
      "190\n",
      "What is Bandysidan player ID for Sergey Lomanov ?\n",
      "191\n",
      "Who are the writers of the academic subject Ten simple rules for editing Wikipedia?\n",
      "192\n",
      "Name the female who discovered the Horsehead Nebula.\n",
      "193\n",
      "Name a fruit composed of Citrullus lanatus that starts with letter W\n",
      "194\n",
      "What conflict is depicted is Raising the Flag on Iwo Jima?\n",
      "195\n",
      "What what is unary operation notation by integral symbol and which that starts with {'i'}\n",
      "196\n",
      "No item found for 'Unary operation notation'\n",
      "What is being treated in an individual with arteriosclerosis?\n",
      "197\n",
      "What is the category for recipients for the Noble Prize?\n",
      "198\n",
      "At what rate was inflation in Venezuela in the year 1996?\n",
      "199\n",
      "When was Vittorio De Sica nominated for an Academy Award for Best Supporting Actor?\n",
      "200\n",
      "What is Auñamendi ID of Miguel López de Legazpi ?\n",
      "201\n",
      "What is the timezone of the place Sallust died?\n",
      "202\n",
      "Did the East India Company own the Britannia and the Busbridge?\n",
      "203\n",
      "Which is the ISNI for Marit Bjørgen?\n",
      "204\n",
      "What is total fertility rate of Trinidad and Tobago that is determination method is estimation process ?\n",
      "205\n",
      "Which church is located in the parish border Krukengrund?\n",
      "206\n",
      "What was Philip Roth nominated for in 2011?\n",
      "207\n",
      "Where is the deathplace of Gediminas, whose twin town is Irkutsk?\n",
      "208\n",
      "What is the fuel system of electricity?\n",
      "209\n",
      "In the 68th Academy Awards, what nomination did Mira Sorvino receive?\n",
      "210\n",
      "Tell me interface standard whose name has the word virtuallink in it.\n",
      "211\n",
      "No property found for 'Interface standard name'\n",
      "What is Ferenc Molnar's compArt person ID?\n",
      "212\n",
      "Which is the Great Aragonese Encyclopedia ID for Allium cepa?\n",
      "213\n",
      "Tell me medical specialty whose name has the word trichology in it.\n",
      "214\n",
      "how many performances are by jimi hendrix?\n",
      "215\n",
      "What is the state of India that contain the word \"uttarakhand\" in its name ?\n",
      "216\n",
      "Who is drafted by the Boston Celtics?\n",
      "217\n",
      "Name the BAFTA settlement with the postcode DA.\n",
      "218\n",
      "Is the maximum number of players for the coxless four 0.0?\n",
      "219\n",
      "Name a religious concept in Hinduism that contains the word \"yatra\" in its name\n",
      "220\n",
      "Which is the golf course arena carrying designs patterns of Donald Trump?\n",
      "221\n",
      "n/a\n",
      "222\n",
      "What is the religious affiliation of Vladimir the Great's child?\n",
      "223\n",
      "What was the population of the Maldives in 1967?\n",
      "224\n",
      "What year did Le Corbusier win the Frank P. Brown Medal?\n",
      "225\n",
      "No property found for 'Award name'\n",
      "Tell me the city which is enclaved within Montreal.\n",
      "226\n",
      "who was the pope replaced by?\n",
      "227\n",
      "Is it true that the minimum wavelength sensitivity of the Giant Magellan Telescope is 320?\n",
      "228\n",
      "Which is a used metre of lliad?\n",
      "229\n",
      "\"Where is {on harbour} of {Kryvyi Rih}, which has {tributary} is {Saksahan} ?\"\n",
      "230\n",
      "Who stars with Ian Carlyle in the production?\n",
      "231\n",
      "What causes rain?\n",
      "232\n",
      "What is the service branch  by Julius and Ethel Rosenberg, which has subsidiary entities including Arlington National Cemetery?\n",
      "233\n",
      "Was Hank WIlliams a rockabilly and honky-tonk musician?\n",
      "234\n",
      "When did Aaron Kwok receive the award for Golden Horse Award for Best Leading Actor?\n",
      "235\n",
      "When did Marco Polo marry Donata Badoer?\n",
      "236\n",
      "Who was Al Gore's spouse beginning in 1970?\n",
      "237\n",
      "What appearance of a Christmas tree happens every January 19?\n",
      "238\n",
      "What is the home venue of the Green Bay Packers?\n",
      "239\n",
      "Which is the enterprise for the parent organization of Sears?\n",
      "240\n",
      "Who proved the theory of Proper Motion? Their surname is Halley.\n",
      "241\n",
      "What head coach is the New York Yankees named after?\n",
      "242\n",
      "What are the national cuisine which start with the letter m\n",
      "243\n",
      "Which is the television series which contains the word zigby in it's name?\n",
      "244\n",
      "Tell me about spouse of Barbara Walters and start time?\n",
      "245\n",
      "What is the second language of Peter Faber which regulatory body is Pontifical Academy of Latin?\n",
      "246\n",
      "What is the honorary title given to Albert Gunther which was won by P.A. Buxton?\n",
      "247\n",
      "Is it true that the topographic isolation of Pollux equals to 0.7?\n",
      "248\n",
      "What award did Edward C. Prescott receive on 1-1-2004?\n",
      "249\n",
      "where is the headquartes of  formation of google located?\n",
      "250\n",
      "What is melody of Tristan und Isolde ?\n",
      "251\n",
      "What time has Manhattan listed as the end time for a maritime evacuation event?\n",
      "252\n",
      "What has the eccentricity of 0.0567, that is located on astronomical body of the near side of the moon?\n",
      "253\n",
      "What is the diplomatic relations like in basin countries of Lake Okeechobee?\n",
      "254\n",
      "What two cities hold the principle offices of Financial Times?\n",
      "255\n",
      "No property found for 'Principle Office'\n",
      "How many active ingredients are in lidocaine?\n",
      "256\n",
      "Where was Augustus II the Strong buried?\n",
      "257\n",
      "Is it true that the semi-major axis of 1627 Ivar is greater than 2.2361778?\n",
      "258\n",
      "What is the CBS municipality code of Nijmegen?\n",
      "259\n",
      "Was Herbie Hancock the winner of the award for the Grammy Award for Best Pop Collaboration with Vocals?\n",
      "260\n",
      "What is the total fertility rate of Sudan with estimation process?\n",
      "261\n",
      "Is the half-life of silicon-36 less than 0.54?\n",
      "262\n",
      "What is a sovereign state for office held by the pope's head of state?\n",
      "263\n",
      "What is the Malayalam alphabet?\n",
      "264\n",
      "Which programming language did Dennis M. Ritchie create?\n",
      "265\n",
      "WHICH IS THE ZUCKERART THAT CONTAINS WITH THE WORD SYRUP IN THER NAME\n",
      "266\n",
      "Which reward was The Diary of Anne Frank a nominee for?\n",
      "267\n",
      "Name a business whose heaquarters are located in Lyon\n",
      "268\n",
      "What is the Commons category of Classic of Poetry ?\n",
      "269\n",
      "Who was married to Ida Lupino on January 1st, 1951?\n",
      "270\n",
      "What agent had conflict with Lowell English?\n",
      "271\n",
      "What does European Parliament approve?\n",
      "272\n",
      "WHat location that belongs to the World Heritage starts with the letter H\n",
      "273\n",
      "mike krzyzewski name\n",
      "274\n",
      "What is Fantastic Fiction author ID of James Ellroy?\n",
      "275\n",
      "Where was Syrie Maugham's country of citizenship in 1927?\n",
      "276\n",
      "\"Who is {took part in} of {boy}, which has {theatre season} is {classical antiquity} ?\"\n",
      "277\n",
      "What administrative territorial entity was Sint Maarten located in the year December 15, 1954?\n",
      "278\n",
      "What is the density of aluminium at a temperature of 20 degrees?\n",
      "279\n",
      "What is the country of citizenship and the religion of Elizabeth_Smart ?\n",
      "280\n",
      "Which is the GeneReviews ID for Alzheimers disease?\n",
      "281\n",
      "When did Artem Sergeev, adopted son of Joseph Stalin, die?\n",
      "282\n",
      "\"What is {holds position} of {Martin McGuinness}, which has {prequel of} is {Member of the 55th Parliament of the United Kingdom} ?\"\n",
      "283\n",
      "What what is animated taxondistributed by MGM and {family}\n",
      "284\n",
      "Which is the SAHRA heritage site ID for University of Cape Town?\n",
      "285\n",
      "What is the CPU with the greatest charge?\n",
      "286\n",
      "When did Sarah Bernhardt and Jacques Damala split up?\n",
      "287\n",
      "\"What is the birth city of Kirsten Stewart, with the county seat of Los Angeles County?\"\n",
      "288\n",
      "Where {faith} {has influence} on {Madonna} ?\n",
      "289\n",
      "What in the code for INS?\n",
      "290\n",
      "When did Alla Pugacheva divorce his wife, Mykolas Orbakas?\n",
      "291\n",
      "When was Isadora Duncan's funeral?\n",
      "292\n",
      "Which is the gens of Sallust?\n",
      "293\n",
      "who culture of state of australian secret intelligence services ?\n",
      "294\n",
      "What are the opening hours for Thursday?\n",
      "295\n",
      "What language does the sculptor of Z3 write in?\n",
      "296\n",
      "What award did I.M. Pei receive in 2010?\n",
      "297\n",
      "\"Where is {deathplace} of {Amelia Earhart}, which has {tributary} is {Ayampe River} ?\"\n",
      "298\n",
      "Was Cleopatra's child named Caesarion?\n",
      "299\n",
      "When did Barry Humphries receive the Centenray medal?\n",
      "300\n",
      "Which chemical compound has the most binding energy?\n",
      "301\n",
      "When did Abigail Adams father die, and who was he?\n",
      "302\n",
      "What was the population of Washington, D.C. at the start of 1860?\n",
      "303\n",
      "Did Mao Zedong hold a position as President of the People's Republic of China?\n",
      "304\n",
      "What effects does arsenic have at the minimal lethal dose of 300?\n",
      "305\n",
      "Is it true that the maximum wavelength of sensitivity of Submilimeter Array is greater than 2.004?\n",
      "306\n",
      "What nonprofit organization is regulated by the association of football?\n",
      "307\n",
      "What diplomatic crisis lead to the founding of the Russian Orthodox Church?\n",
      "308\n",
      "Which is the spacecraft that is manufactured by SpaceX?\n",
      "309\n",
      "When was Boris Johnson the Member of the 56th  Parliament of the United Kingdom?\n",
      "310\n",
      "who  is the city for capital of wales?\n",
      "311\n",
      "Which is the Commons gallery for Georges Seurat?\n",
      "312\n",
      "What is a nut that starts with the letter n.\n",
      "313\n",
      "When is the date and birth of Joseph Stalin's child with Svetlana Alliluyeva?\n",
      "314\n",
      "How many works are occupied in the Rijksmuseum?\n",
      "315\n",
      "Where is the archive for archives of The Walt Disney company?\n",
      "316\n",
      "No item found for ''\n",
      "What is the work of Jack Warner awarded as Academy Award for Best Picture?\n",
      "317\n",
      "What is the birthplace of Maureen O'Hara, which has the co-ordinate location of 53.3252?\n",
      "318\n",
      "What is the official residence of Queens?\n",
      "319\n",
      "Which is the {participant} and the {location} of {Pacific_War} ?\n",
      "320\n",
      "To whom did Gerard Reve got married and when did it end?\n",
      "321\n",
      "What domain has the aspect of bodhisattva?\n",
      "322\n",
      "What is the Commonwealth area with the lowest real gross domestic product growth rate whose diplomatic relation is Taiwan?\n",
      "323\n",
      "What is located on the astronomical body of North America?\n",
      "324\n",
      "Who is the owner of the theatre company that made 'The Birth of the Star Spangled Banner'?\n",
      "325\n",
      "How did John Wilkes Booth kill Abraham Lincoln?\n",
      "326\n",
      "What sovereign state belonging to the International Finance Corporation has the lowest unemployment rate?\n",
      "327\n",
      "Who was the person with Chris Rock when he was awarded the Lunt-Fontanne Award for Ensemble Excellence?\n",
      "328\n",
      "What does Kelly Clarkson do and where is she a citizen?\n",
      "329\n",
      "What is the Uppslagsverket Finland ID for kickboxing?\n",
      "330\n",
      "How many different kinds of industry are affected by furniture?\n",
      "331\n",
      "When did Lee de Forest divorce from Nora Stanton Blatch Barney?\n",
      "332\n",
      "Mention the predecessor and the successor of Louis the Pious while being recognized as king of Franks\n",
      "333\n",
      "does the explosive energy of the tsar bomba equal 500\n",
      "334\n",
      "What is the bibliography of the  PhD advisor to Karl Herzfeld?\n",
      "335\n",
      "What is the interaction of antiparticle symmetric correspondence with Q48460 521.1?\n",
      "336\n",
      "What is the estimation rate of Slovakia fertility?\n",
      "337\n",
      "Tell me {intergovernmental organization}  whose name  starts with s\n",
      "338\n",
      "Is it true that the Wu Tang Clan signed with Loud Records and Ruff Ryders Entertainment?\n",
      "339\n",
      "what is stable version of user interface of amazon kindle?\n",
      "340\n",
      "which award E.T. the Extra-Terrestrial did receive and at what time he got it?\n",
      "341\n",
      "What is the music genre that is made by Battle Zeque Den\n",
      "342\n",
      "When did Ronna Romney McDaniel become chairperson of the Republican Party?\n",
      "343\n",
      "No item found for 'Chairperson of the Republican National Committee'\n",
      "Which is the Basketball-Reference.com NBA player ID of Hakeem Olajuwon?\n",
      "344\n",
      "What are the beliefs of the Chinese Communist Party's Chair, Hu Jintao?\n",
      "345\n",
      "What is { solubility } of { nitrous oxide } { solvent } is { water }?\n",
      "346\n",
      "What type of beryl is found at he GPS coordinates of 24.77111111 34. 71805556?\n",
      "347\n",
      "Which {history of topic} and the {geography of topic} is {Melbourne} ?\n",
      "348\n",
      "What is the sister city of Ivan Turgenev's hometown?\n",
      "349\n",
      "Who was the teacher of the musical score of Suite 1922?\n",
      "350\n",
      "Is a black hole the opposite of a stellar atmosphere?\n",
      "351\n",
      "Did Francis Ford Coppola have notable works of The Godfather and The Godfather Part III?\n",
      "352\n",
      "tell me audio and video interfaces and connectors are name has the word ypbpr in it\n",
      "353\n",
      "What is the official language of lives in Pasi Siltakorpi?\n",
      "354\n",
      "How many colors are next to brown\n",
      "355\n",
      "No property found for 'Adjacent color'\n",
      "What is the active ingredient pharmaceutical product in erythromycin?\n",
      "356\n",
      "Is the PPP GDP per capita of Lithuania less than 22148.8\n",
      "357\n",
      "Is the topographic prominence of the Franzosenkopf less than 4.0?\n",
      "358\n",
      "What Chinese dynasty replaced the Yuan dynasty?\n",
      "359\n",
      "How would you spell meat pie using the international phonetic alphabet?\n",
      "360\n",
      "Where is the human place of birth in Thessaloniki?\n",
      "361\n",
      "What is Anthony Vivaldi's CPDL ID?\n",
      "362\n",
      "did john grisham have a degree in law in the University of mississippi school of law?\n",
      "363\n",
      "Who else participated in Deep Blue with top dog Cray Blitz?\n",
      "364\n",
      "What is GACS ID for West Africa?\n",
      "365\n",
      "When did Johnny Carson start as the presenter for The Tonight Show?\n",
      "366\n",
      "How many armament does the aircraft has?\n",
      "367\n",
      "Where and what did Katherine Dunham study?\n",
      "368\n",
      "Name the women's association football team who play the least in tournaments.\n",
      "369\n",
      "How many input methods are on a computer keyboard?\n",
      "370\n",
      "Tell me me a cryptocurrenc whose name consist of the word \"neo\" and whose stock exchange bitfinex\n",
      "371\n",
      "What are Jews the opposite of and for whom are they named?\n",
      "372\n",
      "What explosive chemical has the highest explosive velocity ?\n",
      "373\n",
      "Is the human genome size more than 3881796000?\n",
      "374\n",
      "Where is the drainage basin of the Brazos River?\n",
      "375\n",
      "Who is C. V. Raman's doctor\n",
      "376\n",
      "Who is the viceroy of Tasmania?\n",
      "377\n",
      "No item found for 'Viceroy of Tasmania'\n",
      "What is at the Kolyma River at the coordinates 161.364?\n",
      "378\n",
      "What is the court and application of jurisdiction of Roe v. Wade?\n",
      "379\n",
      "What are the phantom island which start with the letter T\n",
      "380\n",
      "Which German city is twinned with Cardiff?\n",
      "381\n",
      "How many games did Just Fontaine play for the O.G.C. Nice and how many goals did he score?\n",
      "382\n",
      "What position does David Lloyd George hold?\n",
      "383\n",
      "What portrait has the Woman Drinking Wine wearing a pendant?\n",
      "384\n",
      "Cholera affects which taxon?\n",
      "385\n",
      "Is Schutzstaffel's subsidiary Reich Main Security Office and 21st Waffen Mountain division of the SS Skanderbeg?\n",
      "386\n",
      "In the consort of Myrna Loy, what is the service branch?\n",
      "387\n",
      "No property found for 'Consort'\n",
      "When did Supernatural win the Favorite Pop/Rock Album award?\n",
      "388\n",
      "What is the international organization for World Bank?\n",
      "389\n",
      "What was the population of Aysén Region from 1992-0-0?\n",
      "390\n",
      "What are the historical progress which start with the letter g\n",
      "391\n",
      "what was the position held by john major and when did it end?\n",
      "392\n",
      "Matthias Sindelar who has number of points/goals/set scored as 26.0 is a member of which sports team ?\n",
      "393\n",
      "TELL ME TRADITIONAL FAIRY TALE WHOSE NAME HAS THE WORD SNOW IN IT.\n",
      "394\n",
      "Which award did One Piece receive in 2009?\n",
      "395\n",
      "What is the number of original networks owned by the Discovery Channel?\n",
      "396\n",
      "WHO IS THE PARENT OF SON FRANCESCO I SFORZA ?\n",
      "397\n",
      "Where does Po fit into the location 12.5469?\n",
      "398\n",
      "Which are the cites of Tractatus Logico-Philosophicus?\n",
      "399\n",
      "What has the Pokedex number 36 and follows Pikachu?\n",
      "400\n",
      "What are the fictional detective which start with the letter s\n",
      "401\n",
      "\"Who is {nomination received} of {George Marshall}, which has {champion} is {Mikhail Gorbachev} ?\"\n",
      "402\n",
      "Who is the showrunner of The Apprentice, who also has a sister called Robert Trump?\n",
      "403\n",
      "Were Dutch and Hungarian the official languages of the Holy Roman Empire?\n",
      "404\n",
      "What type of clothing do the characters in The Silent Stars Go By wear?\n",
      "405\n",
      "How do you pronounce coffee in the Georgian language?\n",
      "406\n",
      "tell me demigod of Greek mythology wears hide  starts with h\n",
      "407\n",
      "What is the cardinality of the complex logarithm input set?\n",
      "408\n",
      "No property found for 'Complex logarithm input set'\n",
      "Tell me the famine which starts with the letter t?\n",
      "409\n",
      "WHO DIRECTS THE POLITICAL OFFICE HELD IN EDUARDO LOPEZ DORIGA\n",
      "410\n",
      "What position is held by Ramsay MacDonald and when was he elected?\n",
      "411\n",
      "tell me about thoracic disease that contains the word syndrome in their name\n",
      "412\n",
      "what is the world heritage Tentative liste ID of  Univirsity of Tahran\n",
      "413\n",
      "What language did Juan González de la Pezuela y Ceballos translate for Os Lusíadas?\n",
      "414\n",
      "\"Who is {tenant} of {Windsor Castle}, that has {employment} as {postage stamp designer} ?\"\n",
      "415\n",
      "When did Veronica Lake and Andre dé Toth end their relationship?\n",
      "416\n",
      "which was the series ordinal  for ether which has  ionization energy as 9.53?\n",
      "417\n",
      "Is normal distribution named after Bernhard Riemann?\n",
      "418\n",
      "Is the apoapsis of the Aotearoa 3400 equal to 2.126?\n",
      "419\n",
      "Which bourbon whisky has the lowest alcohol by volume whose country of origin is united states of america?\n",
      "420\n",
      "No item found for 'discontinued distillery'\n",
      "What is the genetic association of major depressive disorder with the determination method TAS?\n",
      "421\n",
      "When did the Three Kingdoms period end in Korea?\n",
      "422\n",
      "What book series did the author Dante Alighieri write?\n",
      "423\n",
      "Tell me biogeochemical cycle whose name has the word cycle in it.\n",
      "424\n",
      "What business, product, or material does Facebook offer?\n",
      "425\n",
      "WHICH IS THE ASSOCIATION OF FOOTCLUB THAT STARTS WITH W\n",
      "426\n",
      "Into how many editions has Othello been translated?\n",
      "427\n",
      "What was the result found in the species of hypothetical protein ipg2828?\n",
      "428\n",
      "Where was professor Dimitri Mendeleyev educated, and what is his expertise?\n",
      "429\n",
      "What team did Peter Schmeichel start playing for in 1984?\n",
      "430\n",
      "Where is the name of the continent of the mountain belt in Mount Caywood?\n",
      "431\n",
      "Is Azcapotzalco in the Mexico City administrative territory?\n",
      "432\n",
      "Which are the grants academic degrees for Master of Business Administration?\n",
      "433\n",
      "No property found for 'educational credential awarded'\n",
      "what was the country of Tyumen in 1991-12-27\n",
      "434\n",
      "Who regulates the genetic association of hsa-miR-5006-3p in molecular biology\n",
      "435\n",
      "Is the toughness of Grivory GM-4H less than 7.2?\n",
      "436\n",
      "what is {PhD advisor} of {favorite player} of {Anthony Giddens, Baron Giddens} ?\n",
      "437\n",
      "Name an unity of measure used for temperature that starts with letter P\n",
      "438\n",
      "What is the temperature of toxaphene that has a density of 1.65?\n",
      "439\n",
      "\"What is name of John Foster Dulles Latin script that has alphabet?\"\n",
      "440\n",
      "Is Ridley Scott the child of Luke Scott and Jordan Scott?\n",
      "441\n",
      "Which new conference did Donald Trump participate in?\n",
      "442\n",
      "who unit of density for measured by of density?\n",
      "443\n",
      "Tell me the point in time for Pierre de Fermat has academic degree as Bachelor of Laws?\n",
      "444\n",
      "Which  anatomical location of place built of zygote ?\n",
      "445\n",
      "No property found for 'Has anatomical location'\n",
      "Which is Greek nymph which was the partner of Apollo?\n",
      "446\n",
      "When did Prince Philip, Duke of Edinburgh use the Arms of Philip Mountbatten (1947-1949) as his coat of arm?\n",
      "447\n",
      "Who was nominated for an Academy Award for  Best Sound Mixing in Gladiator?\n",
      "448\n",
      "What are the national sports team  which start with the letter t\n",
      "449\n",
      "What children did the brothers and sisters of Emmanuel Philibert, Prince of Carignano, have?\n",
      "450\n",
      "At what role did John Tyler replace William Henry Harrison?\n",
      "451\n",
      "Which is FIFA player ID for Stanislav Cherchesov?\n",
      "452\n",
      "Who is {followed by} and {follows} of {{Guy of Lusignan} has {noble title} as {King of Jerusalem}}\n",
      "453\n",
      "Which is the historic era in Epaminondas having completed in 600-1-1?\n",
      "454\n",
      "What was George Washington's military rank between 1774 and 1796?\n",
      "455\n",
      "What was Laurence Olivier nominated for at the 12th Academy Awards?\n",
      "456\n",
      "Which is the Crossref funder ID of the National Museum of American History?\n",
      "457\n",
      "What is the SIRUTA code of Constanta?\n",
      "458\n",
      "Whats the Brockhaus Enzyklopadie online ID of Chile?\n",
      "459\n",
      "Name a Luther city that contain the word \"worms \" in its name\n",
      "460\n",
      "When did Roman Abramovich marry Irina Abramovich?\n",
      "461\n",
      "Is it true that the target interest rate of Central Bank of Azerbaijan equals to 5.25?\n",
      "462\n",
      "Was Rupert Grint's occupation a actor and child actor?\n",
      "463\n",
      "Was Hugh_Grant relative Rick Cosnett?\n",
      "464\n",
      "Which is stated in Tripitaka?\n",
      "465\n",
      "What is the  Mississippi Sports Hall of Fame ID  for Brett Favre ?\n",
      "466\n",
      "What is the academic area of work of Viktor Bespalov?\n",
      "467\n",
      "Which is the GCatholic church ID of Archbasilica of St. John Lateran?\n",
      "468\n",
      "Roger Milla was a member of which sports teams and how many matches did he play?\n",
      "469\n",
      "When did the marriage between Marilyn Monroe and James Dougherty end?\n",
      "470\n",
      "Which is the Kinopoisk person ID for Stanley Donen?\n",
      "471\n",
      "Name a disease that starts with the letter Y\n",
      "472\n",
      "What is on geographical feature of Greater Antilles whose continent is North America ?\n",
      "473\n",
      "No property found for 'located on continent'\n",
      "Ignatius of Loyola belongs to which Catholic order?\n",
      "474\n",
      "What is the {product} of {papermaking} which is {made of} {bleach} called?\n",
      "475\n",
      "What happened to the SS Naronic?\n",
      "476\n",
      "What is {chairwoman} of {working for} of {Vannevar Bush} ?\n",
      "477\n",
      "Who was Jonas Salk's doctoral student?\n",
      "478\n",
      "Shen Bao has a partner city of Rotterdam, what is the main location of the publication?\n",
      "479\n",
      "What are the regions available on the coast of Lower Saxony?\n",
      "480\n",
      "How many medical conditions are treated by diazepam?\n",
      "481\n",
      "Do the rural cities of Para have 13155 inhabitants?\n",
      "482\n",
      "No property found for '13155 inhabitants'\n",
      "What position did William Carmichael replace John Jay in?\n",
      "483\n",
      "What are the type of food or dish that contains the word torta in their name\n",
      "484\n",
      "which type of quantum particle has highest gyromagnetic ratio?\n",
      "485\n",
      "Tell me literary genre whose name has the word vita in it\n",
      "486\n",
      "Which equation do I use to measure horsepower ?\n",
      "487\n",
      "What is the parent company of those who work at Roberta Bondar?\n",
      "488\n",
      "What is the official language of Alice springs-Soverign state?\n",
      "489\n",
      "What is the text input for the Aruba flag emoji?\n",
      "490\n",
      "What is native language for Vincent Auriol ?\n",
      "491\n",
      "Name a memer of the Oracle Corporation\n",
      "492\n",
      "Name a musical composition by Dionysus\n",
      "493\n",
      "Who was the goddess Artemis?\n",
      "494\n",
      "What position did Martin V hold that was eventually replaced by Eugene IV?\n",
      "495\n",
      "None\n",
      "496\n",
      "What was the {award won} by {Cream}, that was {introduced} in {1983-0-0}?\n",
      "497\n",
      "Which  is farthest north of place held by Balkans Campaign?\n",
      "498\n",
      "What is Jacinda Ardern's position ?\n",
      "499\n",
      "500\n",
      "CPU times: user 37.4 s, sys: 5.3 s, total: 42.7 s\n",
      "Wall time: 1h 6min 15s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "queries = generate_lots_of_sparql(lcquad_df['question'].loc[50:549])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "id": "1188317c-7308-4d16-8d3e-a444cac71ee7",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "500"
      ]
     },
     "execution_count": 36,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(queries)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "id": "107452e2-52f1-4595-95bc-28ac3903c801",
   "metadata": {},
   "outputs": [],
   "source": [
    "serialized_list = json.dumps(queries)\n",
    "\n",
    "with open(\"gpt3_turbo_queries.json\", \"w\") as output_file:\n",
    "    output_file.write(serialized_list)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 71,
   "id": "4f18cd97-d42c-43a1-b5ac-609d6f68d906",
   "metadata": {
    "tags": []
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "0\n",
      "SELECT ?country ?tax_rate WHERE { ?country wdt:P31 wd:Q6256 . ?country wdt:P297 ?iso_code . ?country wdt:P710 ?tax . ?tax wdt:P17 ?country . ?tax wdt:P2 ?tax_type . FILTER(?tax_type = wd:Q1056898) BIND(xsd:decimal(?tax) as ?tax_rate) } ORDER BY DESC(?tax_rate) LIMIT 1\n",
      "1\n",
      "SELECT ?date WHERE { ?Q51929074 rdfs:label \"James Thomas Farrell\"@en . ?Q51929074 wdt:Q43380 ?Q618779 . ?Q618779 rdfs:label \"St. Louis Literary Award\"@en . ?Q618779 wdt:Q47150325 ?date . } limit 100\n",
      "2\n",
      "SELECT ?end_date WHERE { wd:Q5593 wdt:P451 ?partner . ?partner wdt:P582 ?end_date . ?partner rdfs:label 'Fernande Olivier'@en . } limit 100\n",
      "3\n",
      "SELECT ?productLabel WHERE { ?product wdt:P31 wd:Q542929 . ?product wdt:Q70339049 ?consumptionRate . ?product wdt:Q96775080* wd:QINSERT . FILTER NOT EXISTS { ?product wdt:Q96775080 ?subProduct . ?subProduct wdt:Q70339049 ?subConsumptionRate . FILTER(?subConsumptionRate < ?consumptionRate) } } ORDER BY ?consumptionRate LIMIT 1 SERVICE wikibase:label {  wikibase:language 'en'. ?product Q18127 ?productLabel. }\n",
      "Request failed with status code 400\n",
      "Failed query number 3\n",
      "4\n",
      "SELECT ?latitude ?longitude WHERE { wd:Q1166 wdt:P625 ?coordinates . ?coordinates wdt:P6258 ?latitude . ?coordinates wdt:P6257 ?longitude } limit 100\n",
      "5\n",
      "SELECT ?result WHERE { wd:Q252 wdt:Q188419 ?life_expectancy . FILTER(?life_expectancy = 55.3528) BIND(xsd:boolean(?life_expectancy = 55.3528) as ?result) } limit 100\n",
      "6\n",
      "SELECT ?start_date WHERE { wd:Q510523 wdt:P69 ?education . ?education wdt:P1711 wd:Q2096836 . ?education wdt:P580 ?start_date . } limit 100\n",
      "7\n",
      "SELECT ?career WHERE { wd:Q553072 wdt:P106 ?occupation . ?occupation wdt:p-SubclassOf* wd:Q115156386 . ?occupation rdfs:label ?career . FILTER(LANG(?career) = 'en') } limit 100\n",
      "8\n",
      "SELECT ?habitat WHERE { ?protein wdt:P688 ?gene . ?gene wdt:P703 ?species . ?protein rdfs:label \"hypothetical protein ecia139-4120\"@en . ?species rdfs:label \"{{Q7432}}\"@en . ?protein wdt:P2974 ?habitat . } limit 100\n",
      "9\n",
      "SELECT Q72940387 WHERE { wd:Q161885 Q21503252/Q21503252/Q61268336* wd:Q3624078 . Q72940387 Q21503252/Q21503252/Q61268336* wd:Q3624078 . Q72940387 Q24575109 wd:Q161885 . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 9\n",
      "10\n",
      "SELECT ?result WHERE { wd:Q671965 wdt:P4912 ?century_break . FILTER(?century_break <= 9.6) BIND(xsd:boolean(?century_break <= 9.6) as ?result) } limit 100\n",
      "11\n",
      "SELECT ?countryLabel WHERE { wd:Q79965 wdt:P625 ?country . ?country wdt:p-Instance_of wd:Q83440 . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "12\n",
      "SELECT  WHERE { ?city wdt:P361 Q57525 . ?city wdt:P190 Q158491 . ?city wdt:P36  . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 12\n",
      "13\n",
      "SELECT ?date WHERE { ?country rdfs:label \"Nicaragua\"@en . ?country wdt:P1082 ?population . ?population wdt:Q186408 ?date . FILTER(?population = 3.87732e+06) } limit 100\n",
      "14\n",
      "SELECT ?definition WHERE { wd:Q187668 wdt:P2325 ?definition . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } } limit 100\n",
      "15\n",
      "SELECT Q37178026 WHERE { Q37178026 wdt:P128 wd:Q2736 . Q37178026 wdt:P31 wd:Q37178026 } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 15\n",
      "16\n",
      "SELECT ?divorce_date WHERE { wd:Q1413 p:P26 ?spouse_statement . ?spouse_statement ps:P26 wd:Q1196129 . ?spouse_statement pq:P580 ?start_time . OPTIONAL { ?spouse_statement pq:P582 ?end_time } FILTER(?start_time <= \"9-6-68\"^^xsd:dateTime) FILTER(!bound(?end_time) || ?end_time >= \"9-6-68\"^^xsd:dateTime) BIND(xsd:string(?end_time) as ?divorce_date) } limit 100\n",
      "17\n",
      " limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 17\n",
      "18\n",
      "SELECT ?award WHERE { ?champion wdt:P2517 wd:Q325945 . ?champion wdt:P166 ?award . ?champion wdt:P1346 ?competition . ?champion wdt: wd:Q80892 . } limit 100\n",
      "19\n",
      "SELECT ?result WHERE { wd:Q118373 wdt:P4130 ?survivor . { SELECT (COUNT(?survivor) as ?count) WHERE { wd:Q118373 wdt:P4130 ?survivor } } FILTER(?count > 0) BIND(xsd:boolean(?count > 0) as ?result) } limit 100\n",
      "20\n",
      "SELECT ?date WHERE { ?secretariat wdt:Q21096945 ?award . ?award wdt:Q21503252 wd:Q618779 . ?award wdt:Q420477 wd:Q1151926 . ?award wdt:Q21096945 wd:Q7843370 . ?award wdt:Q186408 ?date . FILTER(lang(?date) = 'en') } limit 100\n",
      "21\n",
      "SELECT ?result WHERE { ?r1 wdt:P47 ?r2 . ?r2 wdt:P276 wd:Q486972 . ?r1 wdt:P276 wd:Q486972 . ?r1 wdt:P580 ?start_date . FILTER(?start_date = xsd:dateTime('1984-01-01T00:00:00Z')) BIND(xsd:boolean(?start_date = xsd:dateTime('1984-01-01T00:00:00Z')) as ?result) } limit 100\n",
      "22\n",
      "SELECT ?facilityLabel WHERE { ?defensive_wall wdt:P846 ?facility . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "23\n",
      "SELECT ?lighthouse_number WHERE { ?dictionary_item rdfs:label \"IHO Hydrographic Dictionary (S-32)\"@en . ?dictionary_item wdt:P527 ?lighthouse . ?lighthouse wdt:P31 wd:Q39715 . ?lighthouse wdt:P4423 ?lighthouse_number } limit 100\n",
      "24\n",
      "SELECT ?fictional_analog WHERE { ?fictional_analog wdt:P31 Q2593744 . ?fictional_analog rdfs:label ?label . FILTER(LANG(?label) = 'en' && LCASE(?label) = LCASE('Hippocampus')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 24\n",
      "25\n",
      "SELECT ?cause_of_death WHERE { ?cause_of_death wdt:P31 wd:Q146 . ?cause_of_death wdt:P828 ?scan_technique . ?cause_of_death wdt:P509 ?cause_of_death_manner_of_death . FILTER(STRSTARTS(LCASE(?cause_of_death_manner_of_death), 'p') && LCASE(?scan_technique) = 'ct scan') } limit 100\n",
      "26\n",
      "SELECT Q574562 WHERE { Q574562 Q23058136 Q105080069 . Q574562 Q1775415 Q6581097 } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 26\n",
      "27\n",
      "SELECT Q15060255 WHERE { wd:Q129092 wdt:P119/wdt:P131* wd:Q1092107 . wd:Q1092107 wdt:P276 ?area . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 27\n",
      "28\n",
      "SELECT ?naval_artillery ?firing_range WHERE { ?naval_artillery wdt:P31 wd:Q18616576 . ?naval_artillery wdt:P1072 ?firing_range . FILTER NOT EXISTS { ?naval_artillery wdt:P31 wd:Q15720608 } } ORDER BY ASC(?firing_range) LIMIT 1\n",
      "29\n",
      "SELECT ?cayenne_pepper_name WHERE { ?cayenne_pepper wdt:P652 wd:Q6598 . ?cayenne_pepper wdt:P652 wd:Q81204096 . ?cayenne_pepper rdfs:label ?cayenne_pepper_name . FILTER(LANG(?cayenne_pepper_name) = 'en') } limit 100\n",
      "30\n",
      "SELECT ?result WHERE { wd:Q58370919 wdt:P2957 ?throughput . FILTER(?throughput = 2697.672) BIND(xsd:boolean(?throughput = 2697.672) as ?result) } limit 100\n",
      "31\n",
      "SELECT ?method WHERE { wd:Q1643 wdt:P1082 ?population . ?population wdt:P459 ?method . } limit 100\n",
      "32\n",
      "SELECT ?award WHERE { ?person rdfs:label \"Olga Tokarczuk\"@en . ?person wdt:P166 ?award . ?award wdt:P585 ?date . FILTER(YEAR(?date) = 2015) } limit 100\n",
      "33\n",
      "SELECT ?result WHERE { wd:Q937186 wdt:P31 ?result . } limit 100\n",
      "34\n",
      "SELECT ?publisher ?place_of_publication WHERE { wd:Q173626 wdt:P123 ?publisher . wd:Q173626 wdt:P291 ?place_of_publication } limit 100\n",
      "35\n",
      "SELECT ?result WHERE { wd:Q172684 wdt:P69 wd:Q332342 . wd:Q172684 wdt:P69 wd:Q192088 . BIND(xsd:boolean(EXISTS { wd:Q172684 wdt:P69 wd:Q332342 . wd:Q172684 wdt:P69 wd:Q192088 . }) AS ?result) } limit 100\n",
      "36\n",
      "SELECT ?result WHERE { ?novel rdfs:label \"Infinite Jest\"@en . ?novel wdt:P625 ?location . ?location rdfs:label \"Quincy\"@en . ?location wdt:P3032 ?result } limit 100\n",
      "37\n",
      "SELECT ?awarding_institution WHERE { ?honorary_doctorate wdt:P166 ?person . ?honorary_doctorate wdt:P1035 \"Honorary Doctorate\" . ?honorary_doctorate wdt:P166 ?awarding_institution . FILTER(CONTAINS(LCASE(?personLabel), LCASE(\"Eric Hobsbawm\"))) } limit 100\n",
      "38\n",
      "SELECT ?team WHERE { ?player wdt:P54 ?team ; wdt:P106 wd:Q1392194 ; wdt:P569 ?year . FILTER(?year = 1980) FILTER NOT EXISTS { ?player wdt:P582 ?end_date . FILTER(?end_date > \"1980-12-31T23:59:59Z\"^^xsd:dateTime) } } ORDER BY DESC(?player) LIMIT 1\n",
      "39\n",
      "SELECT ?characterLabel WHERE { ?character wdt:P31 wd:Q95074 . ?character wdt:P674 ?universe . FILTER(CONTAINS(LCASE(?universeLabel), LCASE('fictional universe'))) . ?character wdt:P674 ?universe . FILTER(CONTAINS(LCASE(?universeLabel), LCASE('marvel comics'))) . ?character rdfs:label ?characterLabel . FILTER(CONTAINS(LCASE(?characterLabel), LCASE('W'))) . FILTER(LANG(?characterLabel) = 'en') } limit 100\n",
      "40\n",
      "SELECT ?universeLabel WHERE { wd:Q193825 wdt:P973 ?universe . ?universe rdfs:label ?universeLabel . FILTER(LANG(?universeLabel) = 'en') } limit 100\n",
      "41\n",
      "SELECT ?award_received WHERE { wd:Q57191 p:P166 ?award_statement . ?award_statement ps:P166 ?award_received ; pq:P585 ?time . FILTER(?time >= \"1966-01-01T00:00:00Z\"^^xsd:dateTime && ?time <= \"1966-12-31T23:59:59Z\"^^xsd:dateTime) } limit 100\n",
      "42\n",
      "SELECT ?record_label WHERE { ?Q131324 jackson:artistName \"Janet Jackson\" . ?Q131324 wdt:P264 ?record_label . ?record_label wdt:P31 wd:Q18127 . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 42\n",
      "43\n",
      "SELECT ?total_reserves WHERE { wd:Q924 p:P28 ?statement . ?statement ps:P28 wd:Q924 . ?statement pq:P4100 ?total_reserves . } limit 100\n",
      "44\n",
      "SELECT ?result WHERE { wd:Q3962734 wdt:P3840 ?slope_rating . FILTER(?slope_rating = 149) BIND(xsd:boolean(?slope_rating = 149) as ?result) } limit 100\n",
      "45\n",
      "SELECT ?density WHERE { ?compound rdfs:label \"Hydrogen peroxide\"@en . ?compound wdt:P2054 ?density . ?compound wdt:P6879 ?temperature . FILTER(?temperature = 20.0) } limit 100\n",
      "46\n",
      "SELECT ?architecture_firm WHERE { Q1050571 wdt:P276 wd:Q16845909 . Q1050571 wdt:P84 ?architecture_firm . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 46\n",
      "47\n",
      "SELECT ?meansseason WHERE { ?meansseason wdt:P1350 ?start_date . FILTER(MONTH(?start_date) = 2) } limit 100\n",
      "Request failed with status code 500\n",
      "Failed query number 47\n",
      "48\n",
      "SELECT ?winner WHERE { ?event wdt:P166 ?prize . ?event wdt:P1346 ?winner . ?prize rdfs:label \"${prize_awarded}\"@en . ?winner rdfs:label ?winner_label . FILTER(LCASE(?winner_label) = LCASE(\"${champ}\")) } limit 100\n",
      "49\n",
      "SELECT ?ammunition WHERE { ?weapon wdt:P366 wd:Q48967047 . ?weapon wdt:P739 ?ammunition . } limit 100\n",
      "50\n",
      "SELECT ?breedLabel WHERE { ?breed wdt:P31 wd:Q15304597 . ?breed rdfs:label ?breedLabel . FILTER(lang(?breedLabel) = 'en') . FILTER(STRSTARTS(LCASE(?breedLabel), 'z')) } limit 100\n",
      "51\n",
      "SELECT ?coalitionLabel WHERE { wd:Q501758 wdt:P102 ?coalition . ?coalition wdt:p-InstanceOf wd:Q124964 . SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' . } } limit 100\n",
      "52\n",
      "SELECT ?brother_in_law WHERE { ?writer wdt:P50 ?quran . ?brother_in_law wdt:P3373 ?sibling_of_writer . ?sibling_of_writer wdt:P26 ?spouse_of_sibling . ?spouse_of_sibling wdt:P50 ?quran . } limit 100\n",
      "53\n",
      "SELECT ?place_id WHERE { ?place wdt:P31 wd:Q107569809 . ?place rdfs:label \"Auckland\"@en . ?place wdt:P7471 ?place_id . } limit 100\n",
      "54\n",
      "SELECT ?result WHERE { ?painting rdfs:label \"Grade Odalisque\"@en . ?painting wdt:P180 ?depiction . ?depiction rdfs:label ?result . FILTER(STRENDS(str(?result), \"DRTL\")) } limit 100\n",
      "55\n",
      "SELECT ?empireLabel WHERE { ?empire wdt:P31 wd:Q7275 . ?empire rdfs:label ?empireLabel . FILTER(LANG(?empireLabel) = 'en') FILTER(CONTAINS(LCASE(?empireLabel), 'british')) } limit 100\n",
      "56\n",
      "SELECT ?instance WHERE { ?instance wdt:P31 wd:Q8457 . ?instance wdt:P569 ?date_of_birth . FILTER(?date_of_birth = xsd:dateTime('1489-08-01T00:00:00Z')) } limit 100\n",
      "57\n",
      "SELECT Q37226 WHERE { Q37226 Q334384 Q6533159 . Q37226 Q12737077 wd:q-Teacher } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 57\n",
      "58\n",
      "SELECT ?sandre_id WHERE { ?river rdfs:label \"Rhine\"@en . ?river wdt:P1717 ?sandre_id . } limit 100\n",
      "59\n",
      "SELECT ?date WHERE { ?person rdfs:label \"Kylie Minogue\"@en . ?award rdfs:label \"Gold Logie Award for Most Popular Personality on Australian Television\"@en . ?person wdt:P166 ?award . ?person wdt:P585 ?date . } limit 100\n",
      "60\n",
      "SELECT ?business WHERE { ?person rdfs:label \"Alexander McQueen\"@en . ?person wdt:P106 ?business . } limit 100\n",
      "61\n",
      "SELECT ?deityLabel WHERE { wd:Q34201 wdt:Q21503252 wd:Q22989102 . wd:Q34201 wdt:Q31184 ?sibling . ?sibling wdt:Q21503252 wd:Q22989102 . ?sibling rdfs:label ?deityLabel . FILTER(lang(?deityLabel) = 'en') FILTER(CONTAINS(?deityLabel, 'Poseidon')) } limit 100\n",
      "62\n",
      "SELECT ?organizer WHERE { ?game wdt:P1476 'Ultima III: Exodus' . ?game wdt:P664 ?organizer . } limit 100\n",
      "63\n",
      "SELECT ?lead_actor WHERE { ?movie wdt:P31 wd:Q11424 . ?movie wdt:P161 ?lead_actor . ?movie rdfs:label \"Deadpool\"@en . ?lead_actor rdfs:label ?lead_actor_label . FILTER(LANG(?lead_actor_label) = \"en\") } limit 100\n",
      "64\n",
      "SELECT ?workLabel WHERE { ?work wdt:P1441 wd:Q2709 . ?work wdt:P31/wdt:P279* wd:Q2188189 . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } } limit 100\n",
      "65\n",
      "SELECT ?awardLabel WHERE { ?person rdfs:label \"John de Mol\"@en . ?person wdt:P166 ?award . ?award wdt:P585 ?date . FILTER(YEAR(?date) = 2011) SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" } } limit 100\n",
      "66\n",
      "SELECT ?result WHERE { wd:Q262 wdt:Q285897 ?total_fertility_rate . FILTER(?total_fertility_rate > 3.4284) BIND(xsd:boolean(?total_fertility_rate > 3.4284) as ?result) } limit 100\n",
      "67\n",
      "SELECT ?time WHERE { ?water wdt:P2067 ?triple_point . ?water wdt:P2073 ?pressure . ?water wdt:P2072 ?temperature . FILTER(?pressure = ?triple_point_pressure && ?temperature = ?triple_point_temperature) ?water wdt:P585 ?time . } limit 100\n",
      "68\n",
      "SELECT ?phenomenonLabel WHERE { ?phenomenon wdt:P31/wdt:P279* Q93398212 . ?phenomenon Q18127 ?phenomenonLabel . FILTER(LANG(?phenomenonLabel) = 'en') FILTER(CONTAINS(LCASE(?phenomenonLabel), 'surface')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 68\n",
      "69\n",
      "SELECT ?place WHERE { wd:Q7747 wdt:P551 ?place . } limit 100\n",
      "70\n",
      "SELECT ?municipality WHERE { ?eu wdt:P159 ?headquarters . ?headquarters wdt:P131 ?municipality . ?municipality wdt:p-country Q31 } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 70\n",
      "71\n",
      "SELECT ?result WHERE { ?result wdt:P652 wd:Q449506 . ?result wdt:P1843 'Domestic Goat' } limit 100\n",
      "72\n",
      "SELECT ?result WHERE { wd: wdt:P706 ?result . } limit 100\n",
      "73\n",
      "SELECT ?battleLabel WHERE { ?battle wdt:P4791 wd:Q216124 . SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' . } } limit 100\n",
      "74\n",
      "SELECT ?temperature ?state_of_matter WHERE { wd:Q7892 wdt:Q11579 ?temperature . wd:Q7892 wdt:Q108807274 ?state_of_matter . FILTER(?temperature = 647.096) FILTER(?state_of_matter = wd:Q7269030) } limit 100\n",
      "75\n",
      "SELECT ?point_in_time WHERE { ?syria Q15715409 ?population . ?population Q24533326 ?population_amount . ?population_amount Q2360980 ?amount . ?population_amount wikibase:quantityUnit Q5 . ?population_amount Q186408 ?point_in_time_statement . ?point_in_time_statement ps:P585 ?point_in_time . FILTER(?amount = 8.08815e+06) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 75\n",
      "76\n",
      "SELECT ?result WHERE { wd:Q39809 wdt: ?involvement1 . ?involvement1 (wdt:p-SubclassOf)* wd:Q5936993 . ?involvement2 (wdt:p-SubclassOf)* wd:Q207822 . wd:Q39809 wdt: ?involvement2 . BIND(xsd:boolean(EXISTS {?involvement1 (wdt:p-SubclassOf)* wd:Q5936993 . ?involvement2 (wdt:p-SubclassOf)* wd:Q207822}) as ?result) } limit 100\n",
      "77\n",
      "SELECT ?stage_race (COUNT(?event) AS ?event_count) WHERE { ?stage_race wdt:P31 wd:Q207694 . ?stage_race wdt:P793 ?event . } GROUP BY ?stage_race ORDER BY DESC(?event_count) LIMIT 1\n",
      "78\n",
      "SELECT ?municipality_key WHERE { ?municipality wdt:P439 ?municipality_key . ?municipality rdfs:label 'Klagenfurt'@en . ?municipality wdt:P17 wd:Q40 . } limit 100\n",
      "79\n",
      "SELECT ?regionLabel WHERE { ?region wdt:Q21503252 wd:Q17269 . ?region Q18127 ?regionLabel . FILTER(lang(?regionLabel) = 'en') FILTER(CONTAINS(LCASE(?regionLabel), 'xinjiang')) FILTER(?region wdt:Q83440 wd:Q985488) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 79\n",
      "80\n",
      "SELECT ?race ?time WHERE { ?race wdt:P1346 Q12044712 . ?race wdt:P2781 ?time . ?race wdt:P2094 ?competition . ?competition rdfs:label \"Velká pardubická\"@en . } ORDER BY ASC(?time) LIMIT 1\n",
      "Request failed with status code 400\n",
      "Failed query number 80\n",
      "81\n",
      "SELECT ?author ?award WHERE { ?work wdt:P1476 \"Watchmen\" . ?work wdt:P50 ?author . ?author wdt:P166 ?award . } limit 100\n",
      "82\n",
      " limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 82\n",
      "83\n",
      "SELECT ?bookLabel WHERE { ?book wdt:P31 wd:Q571 . ?book wdt:P407 wd:Q143 . ?book rdfs:label ?bookLabel . FILTER(LANG(?bookLabel) = 'en') } LIMIT 1\n",
      "84\n",
      "SELECT ?general_managerLabel WHERE { wd:Q109255 wdt:P505 ?general_manager . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } } limit 100\n",
      "85\n",
      "SELECT ?film_name WHERE { ?film wdt:P31 wd:Q11424 . ?film wdt:P577 ?date . ?film wdt:P2142 ?rating . ?film wdt:P2130 ?cost . FILTER(?rating = 'FSK 12'@en) FILTER(?date < NOW()) BIND(?cost as ?cost_in_euros) FILTER(?cost_in_euros = (SELECT MAX(?cost2) WHERE { ?film2 wdt:P2142 ?rating . ?film2 wdt:P2130 ?cost2 . FILTER(?rating = 'FSK 12'@en) })) ?film rdfs:label ?film_name . FILTER(LANG(?film_name) = 'en') } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 85\n",
      "86\n",
      "SELECT (COUNT(?item) as ?count) WHERE { ?item rdfs:label ?label . FILTER(CONTAINS(LCASE(?label), 'daniel dennett')) . ?item wdt:P683 ?interest } limit 100\n",
      "87\n",
      "SELECT ?Q34578231 WHERE { ?event Q186408 ?date . ?event wdt:P131 Q23154 . ?event Q21503252 ?type . FILTER(YEAR(?date) = 1996) FILTER(CONTAINS(LCASE(?Q1542343), 'event')) SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' . } } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 87\n",
      "88\n",
      "SELECT ?source WHERE { wd:Q584 wdt:P248 ?source . } limit 100\n",
      "89\n",
      " limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 89\n",
      "90\n",
      "SELECT ?tower WHERE { ?tower wdt:P180 wd:Q41213 . ?tower rdfs:label ?label . FILTER(CONTAINS(LCASE(?label), 'babel') && LANG(?label) = 'en') } limit 100\n",
      "91\n",
      "SELECT ?position ?election_date ?reason_for_leaving WHERE { wd:Q128985 wdt:P39 ?position_statement . ?position_statement ps:P39 ?position . ?position_statement pq:P1614 wd:Q21084451 . OPTIONAL { ?position_statement pq:P2715 ?election . ?election Q186408 ?election_date . } OPTIONAL { ?position_statement pq:P10441 ?reason . ?reason rdfs:label ?reason_for_leaving . FILTER(LANG(?reason_for_leaving) = 'en') } } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 91\n",
      "92\n",
      "SELECT ?result WHERE { wd:Q430024 wdt:P3737 ?max_wavelength . FILTER(?max_wavelength = 700) BIND(xsd:boolean(?max_wavelength = 700) as ?result) } limit 100\n",
      "93\n",
      "SELECT ?birth_location WHERE { wd:Q62835 wdt:Q1322263 ?birth_location . FILTER(?birth_location = wd:) } limit 100\n",
      "94\n",
      "SELECT ?nobel_laureate WHERE { ?nobel_laureate wdt:P31 wd:Q5 . ?nobel_laureate wdt:P166 wd:Q7191 . ?nobel_laureate wdt:P802 wd:Q8998 . ?nobel_laureate wdt:P166 ?prize . ?prize wdt:P31 wd:Q19020 . ?prize wdt:P585 ?date . FILTER(?date > \"YEAR-01-01T00:00:00Z\"^^xsd:dateTime) } ORDER BY ASC(?date) LIMIT 1\n",
      "95\n",
      "SELECT ?date WHERE { ?person wdt:P166 ?award . ?award wdt:P166Recipient ?recipient . ?recipient rdfs:label \"Eiji Toyoda\"@en . ?award wdt:P166ForWork ?work . ?work rdfs:label \"Order of Prince Henry\"@en . ?award wdt:P166Date ?date . } limit 100\n",
      "96\n",
      "SELECT ?start_date ?end_date WHERE { wd:Q181 wdt: ?employment_history . ?employment_history ps:P108 [rdfs:label \"Bomis\"@en] ; ps:P580 ?start_date . OPTIONAL { ?employment_history ps:P582 ?end_date } } limit 100\n",
      "97\n",
      "SELECT ?author WHERE { wd:Q57085 wdt:P2680 ?book . ?book wdt:P50 ?author . } limit 100\n",
      "98\n",
      "SELECT ?person WHERE { ?org wdt:P625 wd:Q60 . ?person wdt:P108 ?org . ?person rdfs:label ?person_label . FILTER(LANG(?person_label) = 'en' && ?person_label = 'Michelle Wolf') } limit 100\n",
      "99\n",
      "SELECT ?unit_of_measurement WHERE { ?unit_of_measurement wdt:P2370 ?symbol . FILTER(regex(?symbol, '^visus', 'i')) } limit 100\n",
      "100\n",
      "SELECT ?publication_date WHERE { ?itunes Q27860817 \"12.7.5\" . ?itunes Q1361758 ?publication_date . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 100\n",
      "101\n",
      "SELECT ?languageLabel WHERE { ?language wdt:P287 wd:Q45575 . ?language wdt:P3966 wd:Q223335 . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } } limit 100\n",
      "102\n",
      "SELECT ?role WHERE { ?mickey_mouse wdt:P50 ?ben_sharpsteen . ?mickey_mouse wdt:P106 ?role . FILTER(?mickey_mouse = Q11934) FILTER(?ben_sharpsteen = Q2549739) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 102\n",
      "103\n",
      "SELECT ?stock_exchange WHERE { ?company rdfs:label \"Tencent\"@en . ?company wdt:P249 \"0700\" . ?company wdt:P414 ?stock_exchange . } limit 100\n",
      "104\n",
      "SELECT ?head_of_state_label ?office_label WHERE { wd:Q15180 wdt:P1906 ?head_of_state . ?head_of_state wdt:P106 ?office . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . ?head_of_state rdfs:label ?head_of_state_label . ?office rdfs:label ?office_label . } } limit 100\n",
      "105\n",
      "SELECT ?awardLabel WHERE { wd:Q229040 wdt:P710/wdt:Q21096945 ?award . ?award rdfs:label ?awardLabel . FILTER(LANG(?awardLabel) = 'en') } limit 100\n",
      "106\n",
      "SELECT ?parent_organization WHERE { wd:Q7801 wdt:P749 ?parent_organization . } limit 100\n",
      "107\n",
      "SELECT ?beginning WHERE { wd:Q11194 wdt:P1350 ?beginning . } limit 100\n",
      "108\n",
      "SELECT ?eventLabel WHERE { ?event wdt:P710 wd:Q320 . ?event wdt:P813 ?date . FILTER(?date >= \"1978-06-01T00:00:00Z\"^^xsd:dateTime && ?date < \"1978-06-02T00:00:00Z\"^^xsd:dateTime) . ?event wdt:P800 ?significance . FILTER(?significance = wd:Q24628935) . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "109\n",
      "SELECT ?solubility WHERE { ?Q422709 wdt: ?solubility . FILTER(lang(?solubility) = 'en') } limit 100\n",
      "110\n",
      "SELECT ?stateLabel WHERE { wd:Q143762 wdt:P206 ?state . ?state wdt:P206 wd:Q143762 . ?state rdfs:label ?stateLabel . FILTER(lang(?stateLabel) = 'en') } LIMIT 5\n",
      "111\n",
      " limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 111\n",
      "112\n",
      "SELECT ?languageLabel WHERE { wd: wdt:P103 ?language . SERVICE wikibase:label { bd:serviceParam wikibase:language 'en'. } } limit 100\n",
      "113\n",
      "SELECT ?ionization_energy WHERE { ?nicotine wdt:P2260 ?ionization_energy . FILTER(lang(?ionization_energy) = 'en') } limit 100\n",
      "114\n",
      "SELECT ?result WHERE { wd:Q12204 wdt:P1193 ?prevalence . BIND(xsd:boolean(?prevalence) as ?result) } limit 100\n",
      "115\n",
      "SELECT ?creator WHERE { ?work wdt:P31 wd:Q11424 . ?work rdfs:label \"Star Trek Into Darkness\"@{language} . ?work wdt:P50 ?creator . ?creator rdfs:label ?creator_label . FILTER(LCASE(?creator_label) = LCASE(\"{creators}\")) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 115\n",
      "116\n",
      "SELECT ?spouse ?divorce_date WHERE { ?person wdt:P26 ?spouse_statement . ?spouse_statement ps:P26 wd:Q11617 . OPTIONAL { ?spouse_statement pq:p-EndTime ?divorce_date . } } limit 100\n",
      "117\n",
      "SELECT ?result WHERE { wd:Q78474 wdt:P1532 ?nationality . ?nationality rdfs:label \"{{nationality}}\"@en . wd:Q78474 wdt:P466 ?inhabitant . ?inhabitant rdfs:label ?result . FILTER(LANG(?result) = \"en\") } limit 100\n",
      "118\n",
      "SELECT ?buildingLabel WHERE { wd:Q49088 wdt:P1416 ?building . ?building rdfs:label ?buildingLabel . FILTER(LANG(?buildingLabel) = 'en') } limit 100\n",
      "119\n",
      "SELECT Q484170 WHERE { ?commune Q18954751 Q142 . ?commune Q15715409 ?population . ?commune Q941023 Q6655 . FILTER(?population = Q57275539) SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" } } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 119\n",
      "120\n",
      "SELECT ?district WHERE { ?district wdt:P131 wd:Q515 . { SELECT (MAX(?count) as ?max_count) WHERE { ?house wdt:P131 wd:Q515 . ?house wdt:P31 wd:Q3947 . ?district wdt:P527 ?house . BIND(COUNT(?house) as ?count) } } . ?district wdt:P527 ?house . ?house wdt:P31 wd:Q3947 . { SELECT (MAX(?count) as ?max_count) WHERE { ?house wdt:P131 wd:Q515 . ?house wdt:P31 wd:Q3947 . ?district wdt:P527 ?house . BIND(COUNT(?house) as ?count) } } FILTER(?count = ?max_count) } limit 100\n",
      "121\n",
      "SELECT ?occupation ?field_of_work ?worked_in_Dublin_Castle WHERE { ?person rdfs:label \"Bram Stoker\"@en . ?person wdt:P106 ?occupation . ?person wdt:P101 ?field_of_work . OPTIONAL { ?person wdt:P937 wd:Q295978 } BIND(xsd:boolean(?person = wd:Q1289 && ?worked_in_Dublin_Castle = wd:Q295978) as ?worked_in_Dublin_Castle) } limit 100\n",
      "122\n",
      "SELECT (COUNT(?season) as ?result) WHERE { ?season wdt:P118 wd:Q175762 . } limit 100\n",
      "123\n",
      "SELECT ?place_of_residence WHERE { ?person rdfs:label \"Wangari Maathai\"@en . ?person wdt:P551 ?place_of_residence . ?place_of_residence wdt:P1279 ?inflation_rate . FILTER(?inflation_rate = 2.9) } limit 100\n",
      "124\n",
      "SELECT ?child WHERE { ?child wdt:P22 Q19604 . ?child wdt:P22 Q273616 } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 124\n",
      "125\n",
      "SELECT ?beverageLabel WHERE { ?beverage wdt:P31 wd:Q154 and ?beverage rdfs:label ?beverageLabel . FILTER(LANG(?beverageLabel) = 'en' && CONTAINS(LCASE(?beverageLabel), 'rum')) } LIMIT 1\n",
      "Request failed with status code 400\n",
      "Failed query number 125\n",
      "126\n",
      "SELECT (COUNT(?terminus) as ?count) WHERE { ?terminus wdt:P559 Q1741 } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 126\n",
      "127\n",
      "SELECT ?itemLabel WHERE { ?item wdt:P131 wd: . ?item wdt:P150 wd:Q133642 . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } } limit 100\n",
      "128\n",
      "SELECT ?sister_city WHERE { wd:Q92161 wdt:P190 ?sister_city . ?sister_city wdt:P580 ?start_time . FILTER(?start_time <= \"1992-08-25T00:00:00Z\"^^xsd:dateTime) OPTIONAL { ?sister_city wdt:P582 ?end_time . FILTER(?end_time >= \"1992-08-25T00:00:00Z\"^^xsd:dateTime) } } limit 100\n",
      "129\n",
      "SELECT (COUNT(DISTINCT ?water_body) as ?count) WHERE { wd:Q199551 wdt:P2789 ?water_body . FILTER(?water_body IN (wd:Q4022, wd:Q23397)) } limit 100\n",
      "130\n",
      "SELECT ?soil_type WHERE { ?soil_type rdfs:label ?label . FILTER(CONTAINS(LCASE(?label), 'vertisol') && LANG(?label) = 'en') } limit 100\n",
      "Request failed with status code 500\n",
      "Failed query number 130\n",
      "131\n",
      "SELECT ?id WHERE { ?athlete wdt:P735 \"Lizzy Yarnold\" . ?athlete wdt:P1447 ?id . ?athlete wdt:P856 ?website . FILTER(STRSTARTS(?website, \"http://www.the-sports.org/\")) } limit 100\n",
      "132\n",
      "SELECT ?award_received WHERE { ?person rdfs:label \"Justin Timberlake\"@en . ?person wdt:P166 ?award . ?award wdt:P166Recipient ?person . ?award wdt:P166Date ?date . FILTER(?date >= \"2007-01-01T00:00:00Z\"^^xsd:dateTime && ?date < \"2008-01-01T00:00:00Z\"^^xsd:dateTime) ?award rdfs:label \"P166\"@en . } limit 100\n",
      "133\n",
      "SELECT ?conceptLabel WHERE { ?concept wdt:P279* Q23847174 . ?concept Q18127 ?conceptLabel . FILTER(lang(?conceptLabel) = 'en') FILTER(STRENDS(LCASE(?conceptLabel), 't')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 133\n",
      "134\n",
      "SELECT ?result WHERE { wd:Q1049487 wdt:P2145 ?explosive_energy . FILTER(?explosive_energy < 52.8) BIND(xsd:boolean(?explosive_energy < 52.8) as ?result) } limit 100\n",
      "135\n",
      "SELECT ?date_of_birth WHERE { ?child wdt:P22 wd:Q206191 . ?child wdt:P569 ?date_of_birth . } limit 100\n",
      "136\n",
      "SELECT ?result WHERE { wd:Q742408 wdt:P2665 ?abv . FILTER(?abv < 30.4) BIND(xsd:boolean(?abv < 30.4) as ?result) } limit 100\n",
      "137\n",
      "SELECT ?cityLabel WHERE { ?city Q21503252 Q748149 . ?city Q18127 ?cityLabel . FILTER(lang(?cityLabel) = 'en') FILTER(STRSTARTS(?cityLabel, 'Ürümqi')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 137\n",
      "138\n",
      "SELECT ?ceremony WHERE { ?ceremony Q18127 ?label . FILTER(CONTAINS(LCASE(?label), 'umhlanga') && LANG(?label) = 'en') } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 138\n",
      "139\n",
      "SELECT ?result WHERE { ?Q80071 ?Q46343203 ?Q5431887 . ?Q46343203 rdfs:label \"played as\"@en . BIND(str(?Q46343203) as ?result) } limit 100\n",
      "140\n",
      "SELECT ?runtime WHERE { ?game wdt:P735 \"League of Legends\" . ?game wdt:P747 ?edition . ?edition wdt:P2047 ?runtime . } limit 100\n",
      "141\n",
      "SELECT ?name WHERE { ?amsterdam wdt: ?coat_of_arms . ?coat_of_arms rdfs:label ?name . FILTER(LANG(?name) = 'en') } limit 100\n",
      "142\n",
      "SELECT ?sauce WHERE { ?sauce wdt:P495 Q884 . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 142\n",
      "143\n",
      "SELECT (COUNT(DISTINCT ?depositor) as ?count) WHERE { ?depositor wdt: wd:Q81066 } limit 100\n",
      "144\n",
      "SELECT ?electric_charge WHERE { wd:Q216121 wdt:P2200 ?electric_charge . } limit 100\n",
      "145\n",
      "SELECT ?giver WHERE { ?person wdt:P608 ?isShownBy . ?person wdt:P144 ?basedOn . ?person wdt:P7904 ?giver . FILTER(?isShownBy = <PLACEHOLDER-IS-SHOWN-BY> && ?basedOn = <PLACEHOLDER-BASED-ON> && ?person = <PLACEHOLDER-PERSON>) } limit 100\n",
      "146\n",
      "SELECT ?result WHERE { wd:Q29619735 wdt:P6257 ?longitude . BIND(xsd:float(?longitude) as ?result) } limit 100\n",
      "147\n",
      "SELECT ?team WHERE { ?team Q21503252 Q26887310 . ?team rdfs:label ?label . FILTER(CONTAINS(LCASE(?label), 'team') && LANG(?label) = 'en') } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 147\n",
      "148\n",
      "SELECT ?notable_work_label ?publisher_label WHERE { wd:Q49081 wdt:P800 ?notable_work . ?notable_work wdt:publisher ?publisher . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . ?notable_work rdfs:label ?notable_work_label . ?publisher rdfs:label ?publisher_label . } } ORDER BY DESC(?notable_workLabel) LIMIT 1\n",
      "149\n",
      "SELECT ?code WHERE { ?country Q21503252 Q83440 . ?country Q18127 \"Democratic Republic of Congo\"@en . ?country  ?code . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 149\n",
      "150\n",
      "SELECT ?id WHERE { ?person wdt:P2943 ?id . ?person rdfs:label \"Yuri Gagarin\"@en . } limit 100\n",
      "151\n",
      "SELECT ?result WHERE { wd:Q744 wdt:P2386 ?diameter . FILTER(?diameter = 0.807) BIND(xsd:boolean(?diameter = 0.807) as ?result) } limit 100\n",
      "152\n",
      "SELECT ?result WHERE { wd:Q50334841 p:P569 ?birthdate_statement . ?birthdate_statement ps:P569 ?birthdate . BIND(xsd:integer(year(now()) - year(?birthdate)) as ?age) FILTER(?age > 52) BIND(xsd:boolean(?age > 52) as ?result) } limit 100\n",
      "153\n",
      "SELECT ?date WHERE { wd:Q23564 wdt:P580 ?event . ?event wdt:P31 wd:Q779011 . ?event wdt:P580 ?date . } limit 100\n",
      "154\n",
      "SELECT ?result WHERE { wd:Q14982 wdt:P2116 ?enthalpy . FILTER(?enthalpy = 37400) BIND(xsd:boolean(?enthalpy = 37400) as ?result) } limit 100\n",
      "155\n",
      "SELECT ?award WHERE { wd:Q615944 wdt:P166 ?award . } limit 100\n",
      "156\n",
      "SELECT ?itemLabel WHERE { wd:Q127 wdt:Q98775491 ?item . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "157\n",
      "SELECT (COUNT(?archive) as ?count) WHERE { ?archive wdt:P6241 wd:Q11641 . } limit 100\n",
      "158\n",
      "SELECT ?narrative_location WHERE { ?s wdt:P31 wd:Q9441 . ?s wdt:P840 ?narrative_location . FILTER(LANG(?narrative_location) = 'en') } limit 100\n",
      "159\n",
      "SELECT ?place WHERE { ?place Q96623327 ?location . ?location Q96623327 ?coord . FILTER(?coord < \"Point(2.4697602 48.8363848)\"^^geo:wktLiteral) ?place wdt:P1435 Q205875 . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 159\n",
      "160\n",
      "SELECT ?operation WHERE { ?operation wdt:P31 Q645883 . ?operation Q18127 ?label . FILTER(lang(?label) = 'en' && STRSTARTS(LCASE(?label), 'o')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 160\n",
      "161\n",
      "SELECT ?result WHERE { wd:Q3535481 wdt:P1357 ?matches_drawn . FILTER(?matches_drawn = 0) BIND(xsd:boolean(?matches_drawn = 0) as ?result) } limit 100\n",
      "162\n",
      "SELECT ?mother ?husband WHERE { ?person rdfs:label \"Candice Bergen\"@en . ?person wdt:P25 ?mother . ?person wdt:P26 ?husband . } limit 100\n",
      "163\n",
      "SELECT ?language WHERE { ?film wdt:P1705 ?language . ?film wdt:P161 wd:Q78469 . ?language wdt:P11053 wd:Q51929517 } limit 100\n",
      "164\n",
      "SELECT ?result WHERE { wd:Q56746601 wdt:P4448 ?cash_back . FILTER(?cash_back = 5) BIND(xsd:boolean(?cash_back = 5) as ?result) } limit 100\n",
      "165\n",
      "SELECT ?Q22006653 WHERE { ?Q188784 Q22006653 ?Q22006653 . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 165\n",
      "166\n",
      "SELECT ?use WHERE { ?use wdt:P741 Q369225 . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 166\n",
      "167\n",
      "SELECT ?population WHERE { ?city rdfs:label \"Aden\"@en . ?city wdt:P1082 ?population . ?city wdt:Q21503252 wd:Q515 } limit 100\n",
      "168\n",
      "SELECT ?spouse WHERE { wd:Q295855 wdt:P26 ?spouse_statement . ?spouse_statement ps:P26 ?spouse . ?spouse_statement pq:P580 ?start_time . FILTER(?start_time = \"2006-01-01T00:00:00Z\"^^xsd:dateTime) } limit 100\n",
      "169\n",
      "SELECT ?count WHERE { wd:Q227 wdt:P500 ?exclave . ?exclave wdt:p-country wd:Q34266 .  ?exclave wdt:P1545 ?count . } limit 100\n",
      "170\n",
      "SELECT ?equity WHERE { ?company rdfs:label \"Micron Technology\"@en . ?company wdt:P2137 ?equity . } limit 100\n",
      "171\n",
      "SELECT ?result WHERE { wd:Q395274 wdt:P19 ?place_of_birth . ?place_of_birth rdfs:label ?place_of_birth_label . FILTER(LCASE(?place_of_birth_label) = LCASE('Edmonton')) BIND(xsd:boolean(LCASE(?place_of_birth_label) = LCASE('Edmonton')) as ?result) } limit 100\n",
      "172\n",
      "SELECT ?architect ?heritage_designation WHERE { wd:Q62408 wdt:P84 ?architect . wd:Q62408 wdt:P1435 ?heritage_designation . } limit 100\n",
      "173\n",
      "SELECT ?result WHERE { wd:Q29565582 wdt:P3253 ?opt_temp . FILTER(?opt_temp > 24.0) BIND(xsd:boolean(?opt_temp > 24.0) as ?result) } limit 100\n",
      "174\n",
      "SELECT Q83440 WHERE { Q83440 wdt: Q12444025 } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 174\n",
      "175\n",
      "SELECT ?elementLabel WHERE { ?element wdt:P31 wd:Q11344 . ?element wdt:P137 wd:Q21 . ?element wdt:P136 wd:Q175141 . ?element wdt:P1086 ?melting_point . FILTER(?melting_point < 300 && ?melting_point > 0) . ?element rdfs:label ?elementLabel . FILTER(lang(?elementLabel) = 'en' && regex(?elementLabel, '^O', 'i')) } LIMIT 1\n",
      "176\n",
      "SELECT ?result WHERE { ?player wdt:P647 ?draft_pick . ?player rdfs:label 'Sidney Crosby'@en . ?draft_pick rdfs:label ?result . } limit 100\n",
      "177\n",
      "SELECT (COUNT(?rank) as ?count) WHERE { ?rank wdt:P31 wd:Q186088 . } limit 100\n",
      "178\n",
      "SELECT Q51929074 WHERE { Q51929074 Q48282 Q45936 . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 178\n",
      "179\n",
      "SELECT ?position ?election_date ?position_53rd_parliament WHERE { wd:Q193630 p:position/ps:position ?position . wd:Q193630 p:P39 ?position_held . ?position_held ps:P39 ?position . ?position_held pq:P580 ?election_date . FILTER(YEAR(?election_date) > 0) OPTIONAL { ?position_held pq:P4100 ?position_53rd_parliament } } limit 100\n",
      "180\n",
      "SELECT ?Q3543591 WHERE { ?Q3543591 wdt:P22 wd:Q17853991 . ?Q3543591 wdt:Q21503252 wd:Q5 } limit 100\n",
      "181\n",
      "SELECT ?award ?time WHERE { wd:Q359552 wdt:P1411 ?award_statement . ?award_statement ps:P1411 ?award . ?award_statement pq:P585 ?time . } limit 100\n",
      "182\n",
      "SELECT ?date WHERE { ?person rdfs:label \"John X\"@en . ?person wdt: ?date . ?person p:P1329 ?statement . ?statement ps:P1329 ?date . ?statement pq:P459 ?circumstances . ?circumstances rdfs:label \"sourcing circumstances\"@en . } limit 100\n",
      "183\n",
      " limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 183\n",
      "184\n",
      "SELECT ?result WHERE { wd:Q13371 wdt:P2555 ?fee . FILTER(?fee < 90) BIND(xsd:boolean(?fee < 90) as ?result) } limit 100\n",
      "185\n",
      "SELECT ?person_id WHERE { ?person wdt:P31 wd:Q51929074 . ?person wdt:P5450 ?person_id . ?person rdfs:label \"Carl Rogers\"@en . FILTER(LANG(?person_id) = \"en\") } limit 100\n",
      "186\n",
      "SELECT ?personLabel WHERE { wd:Q128446 wdt:P634 ?person . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } } limit 100\n",
      "187\n",
      "SELECT ?regionLabel WHERE { ?region wdt:P31 Q17269. ?region wdt:P17 Q985488. ?region Q18127 ?regionLabel. FILTER(lang(?regionLabel) = 'en'). FILTER(STRSTARTS(LCASE(?regionLabel), 'x')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 187\n",
      "188\n",
      "SELECT ?timezoneLabel WHERE { wd:Q23482 wdt:P421 ?timezone . ?timezone rdfs:label ?timezoneLabel . FILTER(LANG(?timezoneLabel) = 'en') } limit 100\n",
      "189\n",
      "SELECT ?awardLabel WHERE { wd:Q132695 wdt:P166 ?award . ?award wdt:P1706 wd:Q131326 . SERVICE wikibase:label { bd:serviceParam wikibase:language 'en'. } } limit 100\n",
      "190\n",
      "SELECT ?Q115448723 WHERE { ?Q44613 wdt:P140 wd:Q60995 . ?Q44613 wdt:P159 ?Q115448723 . } limit 100\n",
      "191\n",
      "SELECT ?player_id WHERE { ?person rdfs:label \"Sergey Lomanov\"@en . ?person wdt:P4831 ?player_id . } limit 100\n",
      "192\n",
      "SELECT ?writer WHERE { ?book wdt:P31 wd:Q21145331 . ?book wdt:P50 ?writer . FILTER NOT EXISTS { ?book wdt:P747 ?edition . ?edition wdt:P407 ?language . FILTER(?language = wd:Q1860) } } limit 100\n",
      "193\n",
      "SELECT ?female_name WHERE { ?female wdt:P21 wd:Q6581072 . ?discovery wdt:P61 ?female . ?discovery wdt:P527 wd:Q132959 . ?discovery rdfs:label ?discovery_label . FILTER(LANG(?discovery_label) = 'en' && LCASE(?discovery_label) = 'horsehead nebula') ?female rdfs:label ?female_name . FILTER(LANG(?female_name) = 'en') } limit 100\n",
      "194\n",
      "SELECT ?fruitLabel WHERE { ?fruit wdt:P31 wd:Q3314483 . ?fruit wdt:P105 wd:Q1364 . ?fruit rdfs:label ?fruitLabel . FILTER(LANG(?fruitLabel) = 'en') FILTER(STRSTARTS(LCASE(?fruitLabel), 'w')) } limit 100\n",
      "195\n",
      "SELECT ?conflict WHERE { wd:Q117693 wdt:P180 ?conflict . ?conflict wdt:P31/wdt:P279* wd:Q350604 . } limit 100\n",
      "196\n",
      "SELECT ?unary_operation_notation WHERE { ?unary_operation_notation wdt:P6604 wd: . ?unary_operation_notation wdt:p-Notation ?notation . FILTER(STRSTARTS(?notation, 'i')) } limit 100\n",
      "197\n",
      "SELECT Q34640765 WHERE { ?Q96739634 Q21032523 ?disease . ?disease wdt:P31 Q12136 . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 197\n",
      "198\n",
      "SELECT ?categoryLabel WHERE { wd:Q1262738 wdt:Q7020596 ?category . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "199\n",
      "SELECT ?inflation_rate WHERE { wd:Q717 wdt:Q186408 ?date . ?event wdt:Q186408 ?date . ?event wdt:Q21503252 wd:Q273508 . ?event wdt:Q35186749 ?inflation_rate . FILTER(YEAR(?date) = 1996) } limit 100\n",
      "200\n",
      "SELECT ?date WHERE { ?nomination Q107368869 ?actor . ?nomination Q7048605 Q19020 . ?nomination Q21096945 Q19020 . ?nomination Q186408 ?date . FILTER(regex(str(?actor), 'Vittorio De Sica', 'i')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 200\n",
      "201\n",
      "SELECT ?aunamendi_id WHERE { ?person rdfs:label \"Miguel López de Legazpi\"@en . ?person wdt:P3218 ?aunamendi_id } limit 100\n",
      "202\n",
      "SELECT ?timezoneLabel WHERE { wd:Q7170 wdt:P20 ?placeOfDeath . ?placeOfDeath wdt:P421 ?timezone . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . ?timezone rdfs:label ?timezoneLabel . } } limit 100\n",
      "203\n",
      "SELECT ?result WHERE { wd:Q83164 wdt:P1830 wd:Q185103 . wd:Q83164 wdt:P1830 wd:Q5001294 . BIND(xsd:boolean(EXISTS { wd:Q83164 wdt:P1830 wd:Q185103 . wd:Q83164 wdt:P1830 wd:Q5001294 . }) AS ?result) } limit 100\n",
      "204\n",
      "SELECT ?isni WHERE { ?person rdfs:label \"Marit Bjørgen\"@en . ?person wdt:P213 ?isni . } limit 100\n",
      "205\n",
      "SELECT ?total_fertility_rate WHERE { ?country wdt:Q21503252 wd:Q3624078 . ?country rdfs:label \"Trinidad and Tobago\"@en . ?country wdt:P4841 ?total_fertility_rate . ?country wdt:P459 ?determination_method . ?determination_method rdfs:label \"Estimation process\"@en . } limit 100\n",
      "206\n",
      "SELECT ?church WHERE { ?church wdt:P131 ?parish . ?parish rdfs:label \"Krukengrund\"@en . ?church wdt:P17 ?place . ?place wdt:P131 ?parish . } limit 100\n",
      "207\n",
      "SELECT ?nomination WHERE { ?book wdt:P1411 ?nomination . ?book rdfs:label \"Philip Roth\"@en . FILTER(year(?nomination) = 2011) } limit 100\n",
      "208\n",
      "SELECT ?deathplace WHERE { ?gediminas Q184711 ?twin_town . ?gediminas Q18658526 ?deathplace . FILTER(CONTAINS(?twin_town, 'Irkutsk')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 208\n",
      "209\n",
      "SELECT ?fuel_system WHERE { wd:Q12725 wdt:Q1786017 ?fuel_system . FILTER(LANG(?fuel_system) = 'en') } limit 100\n",
      "210\n",
      "SELECT ?nominationLabel WHERE { wd:Q903494 wdt:P4353 ?nomination . ?nomination wdt:P4353Person wd:Q212026 . ?nomination wdt:P166 ?award . ?award rdfs:label ?awardLabel . FILTER(LANG(?awardLabel) = 'en') } limit 100\n",
      "211\n",
      "SELECT ?interface_standard WHERE { ?interface_standard wdt: ?interface_standard_name . FILTER(CONTAINS(LCASE(?interface_standard_name), 'virtuallink')) } limit 100\n",
      "212\n",
      "SELECT ?compArt_person_id WHERE { ?person wdt:P4772 ?compArt_person_id . ?person rdfs:label \"Ferenc Molnar\"@en . } limit 100\n",
      "213\n",
      "SELECT ?id WHERE { ?item wdt:p-31 wd:q-548284 . ?item wdt:p-1416 ?id . FILTER(LANG(?id) = 'es') } limit 100\n",
      "214\n",
      "SELECT ?specialty WHERE { ?specialty wdt:P31 wd:Q16647973 . ?specialty rdfs:label ?label . FILTER(CONTAINS(LCASE(?label), 'trichology')) } limit 100\n",
      "215\n",
      "SELECT (COUNT(?performance) as ?count) WHERE { ?performance wdt:P175 wd:Q5928 } limit 100\n",
      "216\n",
      "SELECT ?state WHERE { ?state wdt:Q21503252 wd:Q1340361 . ?state Q18127 ?label . FILTER(lang(?label) = 'en' && regex(?label, 'Uttarakhand', 'i')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 216\n",
      "217\n",
      "SELECT ?player WHERE { ?player wdt:P647 wd:Q131371 } limit 100\n",
      "218\n",
      "SELECT ?settlementLabel WHERE { ?settlement wdt:P281 'DA' . ?settlement wdt:P31 wd:Q486972 . SERVICE wikibase:label { Q4837690:Q50892604 wikibase:language 'en' . } } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 218\n",
      "219\n",
      "SELECT ?result WHERE { wd:Q22964457 wdt:P1873 ?max_players . FILTER(?max_players = 0.0) BIND(xsd:boolean(?max_players = 0.0) as ?result) } limit 100\n",
      "220\n",
      "SELECT ?conceptLabel WHERE { ?concept wdt:P279* Q9089 . ?concept Q18127 ?conceptLabel . FILTER(lang(?conceptLabel) = 'en') FILTER(CONTAINS(LCASE(?conceptLabel), 'yatra')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 220\n",
      "221\n",
      "SELECT ?golf_course WHERE { ?golf_course Q5322166 Q22686 . ?golf_course Q1724915 Q1048525 . ?golf_course Q96775080 ?arena . ?arena Q1724915 Q1076486 . ?arena Q96775080 ?design . ?design Q1724915 Q181156 } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 221\n",
      "222\n",
      " limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 222\n",
      "223\n",
      "SELECT ?Q28295582 WHERE { ?Q7569 wdt:P22 wd:Q14974 . ?Q7569 wdt:P140 ?Q28295582 . } limit 100\n",
      "224\n",
      "SELECT ?population WHERE { wd:Q826 wdt:P1082 ?population_statement . ?population_statement ps:P585 ?time . FILTER(YEAR(?time) = 1967) } limit 100\n",
      "225\n",
      "SELECT ?year WHERE { wd:Q4724 wdt:P166 ?award . ?award wdt:P2517 wd:Q4724 . ?award wdt:P166 ?year . ?award wdt: ?award_name . FILTER(CONTAINS(LCASE(?award_name), 'frank p. brown medal')) } limit 100\n",
      "226\n",
      "SELECT ?city WHERE { wd:Q340 wdt:Q237/wdt:Q22808403* ?province . ?city wdt:Q22808403 ?province . ?city wdt:P31 wd:Q515 } limit 100\n",
      "227\n",
      "SELECT ?successorLabel WHERE { wd:Q15840785 wdt:P1366 ?successor . ?successor rdfs:label ?successorLabel . FILTER(LANG(?successorLabel) = 'en') } limit 100\n",
      "228\n",
      "SELECT ?result WHERE { wd:Q652252 wdt:P3738 ?sensitivity . FILTER(?sensitivity = 320) BIND(xsd:boolean(?sensitivity = 320) as ?result) } limit 100\n",
      "229\n",
      "SELECT ?used_metre WHERE { wd:Q8275 wdt:P2551 ?used_metre . } limit 100\n",
      "230\n",
      "SELECT ?harbourLabel ?locationLabel WHERE { ?harbour wdt:P974 wd:Q1633893 . ?harbour wdt:P625 ?location . ?location rdfs:label ?locationLabel . FILTER(LANG(?locationLabel) = 'en') ?harbour rdfs:label ?harbourLabel . FILTER(LANG(?harbourLabel) = 'en' && CONTAINS(?harbourLabel, 'on harbour') && CONTAINS(?harbourLabel, 'Kryvyi Rih')) } limit 100\n",
      "231\n",
      "SELECT ?actor WHERE { ?production wdt:P161 wd:Q42421333 ; wdt:P161 ?actor . } limit 100\n",
      "232\n",
      "SELECT ?cause WHERE { ?rain wdt:P1478 ?cause . FILTER(LCASE(STR(?rain)) = LCASE(STR(\"rain\"@en))) } limit 100\n",
      "233\n",
      "SELECT ?service_branch WHERE { ?service_branch wdt:P112 Q769097 . ?service_branch wdt:P112 Q769097 . ?service_branch wdt:P355 Q216344 } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 233\n",
      "234\n",
      "SELECT ?result WHERE { wd:Q206181 wdt:P136 ?genre . FILTER(?genre IN (wd:Q203720, wd:Q1627155)) BIND(xsd:boolean(?genre IN (wd:Q203720, wd:Q1627155)) as ?result) } limit 100\n",
      "235\n",
      "SELECT ?date WHERE { ?film wdt:P166 Q17500591 . ?film wdt:P2521 Q96474691 . ?film wdt:Q3297652 ?actor . ?actor rdfs:label \"Aaron Kwok\"@en . ?film wdt:Q186408 ?date . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 235\n",
      "236\n",
      "SELECT ?date WHERE { ?marriage_event wdt:P26 wd:Q6101 ; wdt:P813 ?date . ?marriage_event wdt:P451 wd:Q3713678 . } limit 100\n",
      "237\n",
      "SELECT ?spouse WHERE { wd:Q19673 wdt:P26 ?spouse_statement . ?spouse_statement ps:P26 ?spouse . ?spouse_statement pq:P580 ?start_date . FILTER(?start_date >= \"1970-01-01T00:00:00Z\"^^xsd:dateTime) } limit 100\n",
      "238\n",
      "SELECT ?appearance WHERE { ?christmas_tree wdt:P4584 ?appearance . ?appearance Q186408 ?date . FILTER(MONTH(?date) = 1 && DAY(?date) = 19) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 238\n",
      "239\n",
      "SELECT ?venueLabel WHERE { wd:Q213837 wdt:P115 ?venue . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "240\n",
      "SELECT ?Q6881511 WHERE { ?parent wdt:P355 wd:Q19839066 . ?Q6881511 wdt:P749 ?parent . } limit 100\n",
      "241\n",
      "SELECT ?person WHERE { ?person wdt:P8403 ?theory . ?person wdt:P734 'Halley' . FILTER(CONTAINS(LCASE(?theory), 'proper motion')) } limit 100\n",
      "242\n",
      "SELECT ?head_coach WHERE { wd:Q213417 wdt:P286 ?head_coach . ?head_coach rdfs:label ?label . FILTER(LCASE(?label) = LCASE('<<HEAD_COACH_NAME>>')) } limit 100\n",
      "243\n",
      "SELECT ?national_cuisine WHERE { ?national_cuisine Q350895 Q1778821 . FILTER(REGEX(STR(?national_cuisine), '^M', 'i')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 243\n",
      "244\n",
      "SELECT ?series WHERE { ?series rdf:type Q5398426 . ?series Q18127 ?label . FILTER(CONTAINS(LCASE(?label), 'zigby')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 244\n",
      "245\n",
      "SELECT ?spouse ?start_time WHERE { wd:Q231417 wdt:P26 ?spouse_statement . ?spouse_statement ps:P26 ?spouse . OPTIONAL { ?spouse_statement pq:P580 ?start_time } } limit 100\n",
      "246\n",
      "SELECT ?language WHERE { ?person rdfs:label \"Peter Faber\"@en . ?person wdt:P1251 ?language . ?person wdt:p-RegulatoryBody wd:Q48509 . } limit 100\n",
      "247\n",
      "SELECT ?honorary_title WHERE { ?albert_gunther wdt:P166 ?honorary_title . ?p_a_buxton wdt:P166 ?honorary_title . FILTER(?albert_gunther = Q57514) FILTER(?p_a_buxton = Q15994338) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 247\n",
      "248\n",
      "SELECT ?result WHERE { wd:Q12046224 wdt:P2659 ?topographic_isolation . FILTER(?topographic_isolation = 0.7) BIND(xsd:boolean(?topographic_isolation = 0.7) as ?result) } limit 100\n",
      "249\n",
      "SELECT ?awardLabel WHERE { wd:Q312585 wdt:P166 ?award . ?award wdt:P9955 ?date . FILTER(?date = '2004-01-01T00:00:00Z'^^xsd:dateTime) SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' . } } limit 100\n",
      "250\n",
      "SELECT ?location WHERE { ?google wdt:P159 ?headquarters . ?headquarters wdt:P625 ?location . ?formation wdt:P355 ?google . ?formation wdt:P625 ?formation_location . FILTER(CONTAINS(LCASE(?formation_locationLabel), LCASE('formation of google'))) } limit 100\n",
      "251\n",
      "SELECT ?melody WHERE { wd:Q1324254 wdt:P1625 ?melody . } limit 100\n",
      "252\n",
      "SELECT ?end_time WHERE { ?event wdt:P131 ?borough . ?event wdt:P582 ?end_time . FILTER(?borough = wd:Q184) } limit 100\n",
      "253\n",
      "SELECT ?result WHERE { ?item wdt:P1096 0.0567 . ?item wdt:P376 wd:Q782867 . BIND(?item as ?result) } limit 100\n",
      "254\n",
      "SELECT ?relation WHERE { ?basinCountry wdt:P206 ?lake . ?basinCountry wdt:P530 ?relation . FILTER(?lake = wd:Q202905) } limit 100\n",
      "255\n",
      "SELECT ?city WHERE { ?org wdt: ?city . ?org rdfs:label \"Financial Times\"@en . } LIMIT 2\n",
      "256\n",
      "SELECT (COUNT(?active_ingredient) as ?count) WHERE { wd:Q216935 wdt:P3781 ?active_ingredient . } limit 100\n",
      "257\n",
      "SELECT ?place_of_burial WHERE { wd:Q53437 wdt:P119 ?place_of_burial . } limit 100\n",
      "258\n",
      "SELECT ?result WHERE { wd:Q141634 wdt:P2233 ?semi_major_axis . FILTER(?semi_major_axis > 2.2361778) BIND(xsd:boolean(?semi_major_axis > 2.2361778) as ?result) } limit 100\n",
      "259\n",
      "SELECT ?code WHERE { ?Q15284 wdt:P382 ?code . ?Q15284 rdfs:label \"Nijmegen\"@en . } limit 100\n",
      "260\n",
      "SELECT ?result WHERE { wd:Q105875 wdt:P166 ?award . ?award wdt:P166Category wd:Q691203 . ?award wdt:P166Winner wd:Q105875 . BIND(xsd:boolean(true) as ?result) } limit 100\n",
      "261\n",
      "SELECT ?total_fertility_rate WHERE { wd:Q1049 p:P2184 ?statement . ?statement ps:P2184 ?total_fertility_rate . ?statement pq:P585 ?estimation_date . FILTER(CONTAINS(LCASE(?estimation_date), 'estimation')) } limit 100\n",
      "262\n",
      "SELECT ?result WHERE { wd:Q18844603 p:P2939 ?half_life . ?half_life ps:P2939 ?half_life_value . FILTER(?half_life_value < 0.54) BIND(xsd:boolean(?half_life_value < 0.54) as ?result) } limit 100\n",
      "263\n",
      "SELECT ?Q3624078 WHERE { ?pope wdt:P1906 Q237 . ?pope wdt:P1308 ?office_holder . ?office_holder wdt:P1313 ?Q3624078 . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 263\n",
      "264\n",
      "SELECT ?alphabetLabel WHERE { wd:Q18220751 wdt:P527 ?alphabet . ?alphabet rdfs:label ?alphabetLabel . FILTER(LANG(?alphabetLabel) = 'en') } limit 100\n",
      "265\n",
      "SELECT ?programming_language WHERE { ?person rdfs:label \"Dennis M. Ritchie\"@en . ?programming_language wdt:P50 ?person . ?programming_language wdt:P31 wd:Q9143 } limit 100\n",
      "266\n",
      "SELECT ?zuckerart WHERE { ?zuckerart Q18127 ?label . FILTER(CONTAINS(LCASE(?label), 'syrup') && LANG(?label) = 'en') } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 266\n",
      "267\n",
      "SELECT ?rewardLabel WHERE { wd:Q6911 wdt:P1411 ?reward . ?reward rdfs:label ?rewardLabel . FILTER(LANG(?rewardLabel) = 'en') } limit 100\n",
      "268\n",
      "SELECT ?business WHERE { ?business wdt:P159 ?headquarters . ?headquarters rdfs:label \"Lyon\"@en . } limit 100\n",
      "269\n",
      "SELECT ?categoryLabel WHERE { wd:Q17371761 wdt:Q24574745 ?category . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . ?category rdfs:label ?categoryLabel . } } limit 100\n",
      "270\n",
      "SELECT ?person WHERE { ?person wdt:P26 wd:Q148669 . ?person wdt:P2842 ?marriage . FILTER(?marriage >= \"1951-01-01T00:00:00Z\"^^xsd:dateTime && ?marriage < \"1952-01-01T00:00:00Z\"^^xsd:dateTime) } limit 100\n",
      "271\n",
      "SELECT ?agent WHERE { ?agent ?p ?o . ?o rdfs:label \"Lowell English\"@en . ?p rdfs:label \"conflict with\"@en } limit 100\n",
      "272\n",
      "SELECT ?itemLabel WHERE { ?item wdt:P31 wd:Q19096961 . ?item rdfs:label ?itemLabel . FILTER(LANG(?itemLabel) = 'en') } limit 100\n",
      "273\n",
      "SELECT ?location WHERE { ?location wdt:Q21503252 wd:Q9259 . ?location Q18127 ?label . FILTER(lang(?label) = 'en') FILTER(STRSTARTS(LCASE(?label), 'h')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 273\n",
      "274\n",
      "SELECT ?name WHERE { ?Q51929074 rdfs:label \"Mike Krzyzewski\"@en . ?Q51929074 rdfs:label ?name . FILTER(LANG(?name) = \"en\") } limit 100\n",
      "275\n",
      "SELECT ?fantastic_fiction_author_id WHERE { wd:Q318487 wdt:P5408 ?fantastic_fiction_author_id . } limit 100\n",
      "276\n",
      "SELECT ?country_of_citizenship WHERE { wd:Q7663337 wdt:P27 ?country_of_citizenship . ?country_of_citizenship wdt:P31 wd:Q83440 . ?country_of_citizenship wdt:P1082 ?population . FILTER(?population > 0) FILTER NOT EXISTS { ?country_of_citizenship wdt:P582 ?end_time . FILTER(?end_time < \"1927-01-01T00:00:00Z\"^^xsd:dateTime) } } limit 100\n",
      "277\n",
      "SELECT ?result WHERE { ?person wdt:P1344 wd:Q3010 . wd:Q3010 wdt:P2348 wd:Q486761 . ?person rdfs:label ?result . FILTER(LANG(?result) = 'en') } limit 100\n",
      "278\n",
      "SELECT ?entity WHERE { ?entity wdt:P276 wd:Q26273 . ?entity wdt:P31/wdt:P279* wd:Q56061 . ?entity wdt:P580 ?start_time . ?entity wdt:P582 ?end_time . FILTER(?start_time <= \"1954-12-15\"^^xsd:dateTime) FILTER(?end_time >= \"1954-12-15\"^^xsd:dateTime) } limit 100\n",
      "279\n",
      "SELECT ?density WHERE { Q663 Q1048589 ?density . Q663 Q11579 ?temperature . FILTER(?temperature = 20) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 279\n",
      "280\n",
      "SELECT ?country_of_citizenship ?religion WHERE { wd:Q239069 wdt:P27 ?country_of_citizenship . wd:Q239069 wdt:P140 ?religion . } limit 100\n",
      "281\n",
      "SELECT ?gene_review_id WHERE { ?disease_item rdfs:label \"Alzheimers disease\"@en . ?disease_item wdt:P668 ?gene_review_id . } limit 100\n",
      "282\n",
      "SELECT ?date_of_death WHERE { ?person wdt:P734 'Sergeev' . ?person wdt:P735 'Artem' . ?person wdt:P22 wd:Q855 . ?person wdt:P570 ?date_of_death . } limit 100\n",
      "283\n",
      "SELECT ?position WHERE { ?person rdfs:label \"Martin McGuinness\"@en . ?person wdt:P39 ?position_statement . ?position_statement ps:P39 ?position . ?position_statement pq:P156 wd:Q720696 . ?person wdt:P39 wd:Q302424 . } limit 100\n",
      "284\n",
      "SELECT ?film WHERE { ?film wdt:P750 wd:Q179200 . ?film wdt:P136 wd:Q202866 . ?film wdt:P750 ?family . FILTER(CONTAINS(LCASE(str(?family)), LCASE('{family}'))) } limit 100\n",
      "285\n",
      "SELECT ?Q59677995 WHERE { ?Q951305 wdt:P373 ?category . ?category wdt:P3759 ?Q59677995 . FILTER(REGEX(STR(?Q951305), 'University of Cape Town', 'i')) } limit 100\n",
      "286\n",
      "SELECT ?Q5300 ?charge WHERE { ?Q5300 wdt:P1156 ?charge . } ORDER BY DESC(?charge) LIMIT 1\n",
      "287\n",
      "SELECT ?date WHERE { ?s wdt:P26 ?spouse . ?spouse rdfs:label \"Sarah Bernhardt\"@en . ?spouse wdt:P1534 ?end_cause . ?end_cause rdfs:label ?label . FILTER(LCASE(?label) CONTAINS \"split up\") ?spouse wdt:P582 ?time . BIND(xsd:date(?time) as ?date) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 287\n",
      "288\n",
      "SELECT ?birth_city WHERE { ?person wdt:P19 ?birth_place . ?birth_place wdt:P131 ?birth_city . ?birth_place wdt:p-CountySeat wd:Q104994 . ?person rdfs:label \"Kirsten Stewart\"@en . } limit 100\n",
      "289\n",
      "SELECT ?faith WHERE { wd:Q1744 wdt:P737 ?faith . } limit 100\n",
      "290\n",
      "SELECT ?code WHERE { ?item rdfs:label \"INS\"@en . ?item wdt:P3295 ?code . } limit 100\n",
      "291\n",
      "SELECT ?divorce_date WHERE { ?person wdt:P451 wd:Q16465149 . ?person wdt:P26 wd:Q80510 . ?person wdt:P582 ?divorce_date . } limit 100\n",
      "292\n",
      "SELECT ?date WHERE { ?funeral_event wdt:P8612 wd:Q483512 . ?funeral_event wdt:P813 ?date . } limit 100\n",
      "293\n",
      "SELECT ?gens WHERE { wd:Q7170 wdt:P5025 ?gens . } limit 100\n",
      "294\n",
      "SELECT ?itemLabel WHERE { ?item wdt:P2596 wd:Q181694 . ?item wdt:P1001 wd:Q408 . ?item wdt:P853 wd:Q184560 . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } } limit 100\n",
      "295\n",
      "SELECT ?opening_hours WHERE { wd:Q2221906 wdt:P8626 ?opening_hours . FILTER(STRSTARTS(LCASE(?opening_hours), 'thursday')) } limit 100\n",
      "296\n",
      "SELECT ?languageLabel WHERE { wd:Q2128187 wdt:P50 ?creator . ?creator wdt:P407 ?language . SERVICE wikibase:label { bd:serviceParam wikibase:language 'en'. } } limit 100\n",
      "297\n",
      "SELECT ?awardLabel WHERE { ?person wdt:P166 ?award . ?award wdt:P1817 ?person . ?award wdt:P813 ?date . FILTER(YEAR(?date) = 2010) SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } } limit 100\n",
      "298\n",
      "SELECT ?deathplace WHERE { wd:Q3355 wdt:P20 ?deathplace . ?deathplace wdt:P974 wd:Q1367043 } limit 100\n",
      "299\n",
      "SELECT ?result WHERE { wd:Q635 wdt:P40 ?child . ?child rdfs:label ?child_label . FILTER(LCASE(?child_label) = LCASE('Caesarion')) BIND(xsd:boolean(LCASE(?child_label) = LCASE('Caesarion')) as ?result) } limit 100\n",
      "300\n",
      "SELECT ?date WHERE { ?person rdfs:label \"Barry Humphries\"@en . ?person wdt:Q21096945 Q2393205 . ?person wdt:Q18328126 ?date . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 300\n",
      "301\n",
      "SELECT ?compound ?binding_energy WHERE { ?compound wdt:P31 wd:Q11173 . ?compound wdt:P298 ?binding_energy . } ORDER BY DESC(?binding_energy) LIMIT 1\n",
      "302\n",
      "SELECT ?death_date ?father WHERE { ?father wdt:P40 wd:Q206191 . ?father wdt:P570 ?death_date . } limit 100\n",
      "303\n",
      "SELECT ?population WHERE { wd:Q61 p:P1082 ?population_statement . ?population_statement ps:P1082 ?population . ?population_statement pq:P585 ?time . FILTER(xsd:dateTime(?time) = xsd:dateTime('1860-01-01T00:00:00Z')) } limit 100\n",
      "304\n",
      "SELECT ?result WHERE { wd:Q5816 p:P39 ?position . ?position ps:P39 Q655407 . ?position Q24575110 ?start_time . OPTIONAL { ?position Q24575125 ?end_time } BIND(IF(BOUND(?end_time), xsd:boolean((now() - ?end_time) > 0), xsd:boolean((now() - ?start_time) > 0)) as ?result) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 304\n",
      "305\n",
      "SELECT ?Q10501532 WHERE { ?Q871 wdt:P2316 ?lethal_dose . ?Q871 ?Q29547297 ?Q10501532 . FILTER(?lethal_dose >= 300) FILTER(lang(?Q10501532) = 'en') } limit 100\n",
      "306\n",
      "SELECT ?result WHERE { wd:Q1205241 wdt:P3737 ?max_wavelength . FILTER(?max_wavelength > 2.004) BIND(xsd:boolean(?max_wavelength > 2.004) as ?result) } limit 100\n",
      "307\n",
      "SELECT Q163740 WHERE { Q163740 wdt:P128 wd:Q2736 . Q163740 wdt:P31 wd:Q163740 } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 307\n",
      "308\n",
      "SELECT ?eventLabel WHERE { ?event wdt:P31 wd:Q1190554 . ?event rdfs:label ?eventLabel . FILTER(LANG(?eventLabel) = 'en' && CONTAINS(?eventLabel, 'diplomatic crisis') && CONTAINS(?eventLabel, 'founding') && CONTAINS(?eventLabel, 'Russian Orthodox Church')) } limit 100\n",
      "309\n",
      "SELECT ?spacecraft WHERE { ?spacecraft wdt:P176 Q193701 . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 309\n",
      "310\n",
      "SELECT ?start_date WHERE { wd:Q180589 Q19036877/wdt:P2937 wd:Q21084473 ; Q24575110 ?start_date . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 310\n",
      "311\n",
      "SELECT ?cityLabel WHERE { wd:Q25 wdt:P36 ?capital . ?capital wdt:P131 ?city . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "312\n",
      "SELECT ?commons_gallery WHERE { ?painter rdfs:label \"Georges Seurat\"@en . ?painter wdt:P935 ?commons_gallery } limit 100\n",
      "313\n",
      "SELECT ?nut WHERE { ?nut rdfs:label ?label . FILTER(STRSTARTS(LCASE(?label), 'n') && LANG(?label) = 'en') } limit 100\n",
      "314\n",
      "SELECT ?date_of_birth WHERE { ?child wdt:P22 wd:Q855 . ?child wdt:P25 wd:Q228584 . ?child wdt:P569 ?date_of_birth } limit 100\n",
      "315\n",
      "SELECT (COUNT(?Q386724) as ?count) WHERE { ?Q386724 wdt:P195/wdt:Q15111616 wd:Q190804 . } limit 100\n",
      "316\n",
      "SELECT  WHERE {  wdt:P355 wd:Q7414 .  wdt:P452 wd:Q518155 . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 316\n",
      "317\n",
      "SELECT ?work WHERE { ?person rdfs:label \"Jack Warner\"@en . ?film wdt:P31 wd:Q11424 . ?film wdt:P166 ?award . ?award wdt:P31 wd:Q19020 . ?award wdt:P805 ?person . ?award wdt:P585 ?date . FILTER(YEAR(?date) >= 1927) ?film rdfs:label ?work . FILTER(LANG(?work) = \"en\") } limit 100\n",
      "318\n",
      "SELECT ?birthplace WHERE { ?person wdt:P19 ?birthplace . ?birthplace wdt:P625 ?location . FILTER(?location = \"Point(53.3252 -6.2658)\"^^geo:wktLiteral) } limit 100\n",
      "319\n",
      "SELECT ?residence WHERE { ?Q15862 wdt:P263 ?residence . FILTER(CONTAINS(LCASE(?Q15862Label), LCASE('Q15862'))) } limit 100\n",
      "320\n",
      "SELECT ?participant ?location WHERE { wd:Q184425 wdt:P710 ?participant . wd:Q184425 wdt:P625 ?location . } limit 100\n",
      "321\n",
      "SELECT ?spouse ?end_time WHERE { wd:Q364153 wdt:P26 ?spouse_statement . ?spouse_statement ps:P26 ?spouse . OPTIONAL { ?spouse_statement pq:P582 ?end_time . } } limit 100\n",
      "322\n",
      "SELECT ?domain WHERE { ?aspect wdt:P31 wd:Q1167794 . ?aspect wdt:P1963 ?domain . FILTER(LCASE(STR(?Q74817647)) = LCASE('bodhisattva')) } limit 100\n",
      "323\n",
      "SELECT ?areaLabel WHERE { ?area Q21503252 Q172107 . ?area Q4162051 ?diplomaticRelation . ?area Q58907041 ?realGDPGrowthRate . FILTER(?diplomaticRelation = Q865) FILTER NOT EXISTS { ?area Q58907041 ?higherGDPGrowthRate . FILTER(?higherGDPGrowthRate < ?realGDPGrowthRate) } } ORDER BY ?realGDPGrowthRate LIMIT 1\n",
      "\n",
      "Request failed with status code 400\n",
      "Failed query number 323\n",
      "324\n",
      "SELECT ?itemLabel WHERE { ?item wdt:P376 wd:Q49 . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } } limit 100\n",
      "325\n",
      "SELECT ?owner WHERE { ?company wdt:P112 ?owner . ?company wdt:p-Produced wd:Q21184208 . } limit 100\n",
      "326\n",
      "SELECT ?method_of_death WHERE { wd:Q180914 wdt:P157 ?victim . ?victim rdfs:label \"Abraham Lincoln\"@en . ?event wdt:P8031 ?perpetrator . ?perpetrator wd:Q180914 . ?event wdt:P1196 ?method_of_death . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 326\n",
      "327\n",
      "SELECT ?countryLabel ?unemploymentRate WHERE { ?country wdt:P31 wd:Q3624078 . ?country wdt:P102 wd:Q656801 . ?country wdt:P1198 ?unemploymentRate . SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' . } } ORDER BY ASC(?unemploymentRate) LIMIT 1\n",
      "328\n",
      "SELECT ?person WHERE { ?event Q21096945 Q28007406 . ?event Q107368869 ?person . ?person rdfs:label 'Chris Rock'@en . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 328\n",
      "329\n",
      "SELECT ?occupation ?citizenship WHERE { wd:Q483507 wdt:P106 ?occupation . wd:Q483507 wdt:P27 ?citizenship . } limit 100\n",
      "330\n",
      "SELECT ?id WHERE { ?Q178678 wdt:P4854 ?id . FILTER(LCASE(STR(?Q178678)) = LCASE(\"Q178678\")) } limit 100\n",
      "331\n",
      "SELECT (COUNT(DISTINCT ?industry) AS ?count) WHERE { ?furniture Q900150 ?industry . ?industry Q21503252/wdt:P279* Q15067276 } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 331\n",
      "332\n",
      "SELECT ?date WHERE { ?event wdt:P26 wd:Q354863 . ?event wdt:P154 wd:Q17676 . ?event wdt:P580 ?date . } limit 100\n",
      "333\n",
      "SELECT ?predecessor ?successor WHERE { ?louis Q21503252 Q5. ?louis Q18127 'Louis the Pious'@en. ?louis wdt:Q104481692 ?successor. ?predecessor wdt:Q104481692 ?louis. } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 333\n",
      "334\n",
      "SELECT ?result WHERE { wd:Q188596 wdt:P2145 ?explosive_energy . FILTER(?explosive_energy = 500) BIND(xsd:boolean(?explosive_energy = 500) as ?result) } limit 100\n",
      "335\n",
      "SELECT ?bibliography WHERE { ?advisor wdt:P184 wd:Q84763 . ?advisor wdt:P4327 ?bibliography . } limit 100\n",
      "336\n",
      "SELECT ?interaction WHERE { wd:Q48460 wdt:P2280 ?value . ?value ?p ?o . ?o rdfs:label ?interaction . FILTER(lang(?interaction) = 'en') } limit 100\n",
      "337\n",
      "SELECT ?estimation_rate WHERE { wd:Q214 wdt:P4841 ?estimation_rate . } limit 100\n",
      "338\n",
      "SELECT ?org WHERE { ?org wdt:P31 Q245065 . ?org rdfs:label ?label . FILTER(LANG(?label) = 'en' && STRSTARTS(LCASE(?label), 's')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 338\n",
      "339\n",
      "SELECT ?result WHERE { wd:Q52463 wdt:P264 ?record_label . FILTER(?record_label IN (wd:Q528124, wd:Q1193843)) BIND(xsd:boolean(?record_label IN (wd:Q528124, wd:Q1193843)) as ?result) } limit 100\n",
      "340\n",
      "SELECT ?stable_version WHERE { ?Q136469 wdt:P10627 ?interface . ?interface wdt:P1547 ?software . ?software wdt:P348 ?stable_version . FILTER(CONTAINS(LCASE(?Q18127), 'user interface') && CONTAINS(LCASE(?Q136469_label), 'amazon Q136469')) } limit 100\n",
      "341\n",
      "SELECT ?award ?time WHERE { wd:Q11621 wdt:P166 ?award_statement . ?award_statement ps:P166 ?award . ?award_statement pq:P813 ?time . } limit 100\n",
      "342\n",
      "SELECT ?genreLabel WHERE { ?work wdt:P86 wd:Q4870126 . ?work wdt:P136 ?genre . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . ?genre rdfs:label ?genreLabel . } } limit 100\n",
      "343\n",
      "SELECT ?start_date WHERE { ?person rdfs:label \"Ronna Romney McDaniel\"@en . ?person Q66715753 ?position_held . ?position_held wdt:P279*  . ?position_held Q24575110 ?start_date . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 343\n",
      "344\n",
      "SELECT ?player_id WHERE { wd:Q273256 wdt:P2685 ?player_id . } limit 100\n",
      "345\n",
      "SELECT ?belief WHERE { ?party wdt:P803 wd:Q15029 . ?party wdt:P140 ?belief . ?party wdt:P31 wd:Q17427 } limit 100\n",
      "346\n",
      "SELECT ?solubility WHERE { wd:Q905750 wdt:P2177 ?solubility . wd:Q7892 wdt:P2178 wd:Q905750 . } limit 100\n",
      "347\n",
      "SELECT ?beryl_type WHERE { ?mineral wdt:P625 ?location . ?mineral wdt:P1843 ?beryl_type . FILTER(?location = \"Point(34.71805556 24.77111111)\"^^geo:wktLiteral) } limit 100\n",
      "348\n",
      "SELECT ?result WHERE { wd:Q3141 wdt:P31 ?instance . ?instance wdt:P361 ?history_of_topic . ?instance wdt:P361 ?geography_of_topic . FILTER(?history_of_topic = wd:Q59541917 AND ?geography_of_topic = wd:Q46865913) BIND(xsd:boolean(?history_of_topic = wd:Q59541917 AND ?geography_of_topic = wd:Q46865913) as ?result) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 348\n",
      "349\n",
      "SELECT ?sister_city WHERE { ?Q20666188 wdt:P190 ?sister_city . ?Q20666188 rdfs:label \"Ivan Turgenev's Q20666188\"@en . } limit 100\n",
      "350\n",
      "SELECT ?teacher WHERE { ?suite wdt:P3030 ?score . ?suite wdt:P574 1922 . ?score wdt:P86 ?composer . ?composer wdt:P1066 ?teacher . } limit 100\n",
      "351\n",
      "SELECT ?result WHERE { wd:Q589 wdt:P461 wd:Q54191854 . BIND(xsd:boolean(wd:Q589 wdt:P461 wd:Q54191854) as ?result) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 351\n",
      "352\n",
      "SELECT ?result WHERE { wd:Q56094 wdt:P800 ?notable_work . FILTER(?notable_work IN (wd:Q47703, wd:Q47703PartIII)) BIND(xsd:boolean(?notable_work IN (wd:Q47703, wd:Q47703PartIII)) as ?result) } limit 100\n",
      "353\n",
      "SELECT ?interface ?interfaceLabel WHERE { ?interface wdt:P279* Q11653 . ?interface rdfs:label ?interfaceLabel . FILTER(CONTAINS(LCASE(?interfaceLabel), 'ypbpr') && (CONTAINS(LCASE(?interfaceLabel), 'audio') || CONTAINS(LCASE(?interfaceLabel), 'video')) ) SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' } } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 353\n",
      "354\n",
      "SELECT ?languageLabel WHERE { wd:Q28786447 wdt:P1705 ?language . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "355\n",
      "SELECT (COUNT(?color) as ?count) WHERE { wd:Q13421990 wdt: ?color } limit 100\n",
      "356\n",
      "SELECT ?active_ingredient WHERE { ?pharmaceutical_product wdt:P2076 ?active_ingredient . ?pharmaceutical_product rdfs:label \"erythromycin\"@en . } limit 100\n",
      "357\n",
      "SELECT ?result WHERE { wd:Q37 p:PppPerCapita ?ppp_per_capita_statement . ?ppp_per_capita_statement ps:PppPerCapita ?ppp_per_capita_amount . FILTER(?ppp_per_capita_amount < 22148.8) BIND(xsd:boolean(?ppp_per_capita_amount < 22148.8) as ?result) } limit 100\n",
      "358\n",
      "SELECT ?result WHERE { wd:Q1450454 wdt:P2660 ?topographic_prominence . FILTER(?topographic_prominence < 4.0) BIND(xsd:boolean(?topographic_prominence < 4.0) as ?result) } limit 100\n",
      "359\n",
      "SELECT ?dynastyLabel WHERE { ?dynasty wdt:P31 wd:Q1149652 . ?dynasty wdt:P136 wd:Q7313 . ?dynasty wdt:P136 ?replacedBy . ?replacedBy wdt:P279* wd:Q29416 . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "360\n",
      "SELECT ?ipa WHERE { wd:Q5367573 wdt:P898 ?ipa . } limit 100\n",
      "361\n",
      "SELECT ?place_of_birth WHERE { ?person Q1322263 Q17151 . ?person wdt:P31 wd:Q5 . ?person Q1322263 ?place_of_birth . ?place_of_birth wdt:P131* Q17151 . ?place_of_birth rdfs:label 'PLACEHOLDER_LABEL'@en . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 361\n",
      "362\n",
      "SELECT ?cpdl_id WHERE { ?person rdfs:label \"Anthony Vivaldi\"@en . ?person wdt:P2000 ?cpdl_id . } limit 100\n",
      "363\n",
      "SELECT ?result WHERE { wd:Q106465 Q29614307 wd:Q14693404 . wd:Q106465 Q189533 ?degree . FILTER(CONTAINS(LCASE(?degreeLabel), 'law')) BIND(xsd:boolean(?degree != '') as ?result) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 363\n",
      "364\n",
      "SELECT ?participant WHERE { ?event wdt:P710 wd:Q937297 . ?event wdt:P710 ?participant . FILTER(?participant != wd:Q937297) } limit 100\n",
      "365\n",
      "SELECT ?gacs_id WHERE { ?item wdt:P4427 ?gacs_id . ?item rdfs:label \"West Africa\"@en . } limit 100\n",
      "366\n",
      "SELECT ?start_date WHERE { ?johnny_carson wdt:P106 Q310819 . ?tonight_show wdt:P371 ?johnny_carson . ?tonight_show wdt:P1476 'The Tonight Show' . ?tonight_show wdt:P580 ?start_date . FILTER(lang(?start_date) = 'en') } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 366\n",
      "367\n",
      "SELECT ?armament_count WHERE { wd:Q11436 wdt:P520 ?armament . BIND(COUNT(?armament) as ?armament_count) } limit 100\n",
      "368\n",
      "SELECT ?place_of_study ?field_of_study WHERE { wd:Q272637 wdt:P812 ?field_of_study_statement . ?field_of_study_statement ps:Q29614307 ?place_of_study . } limit 100\n",
      "369\n",
      "SELECT ?team WHERE { ?team wdt:P31 wd:Q28140340 . ?team wdt:P641 ?sport . ?team wdt:P118 ?league . ?team wdt:P1350 ?matches_played . FILTER(?sport = wd:Q2736) FILTER(?league != wd:Q176883) } ORDER BY ASC(?matches_played) LIMIT 1\n",
      "370\n",
      "SELECT (COUNT(?input_method) as ?count) WHERE { wd:Q250 wdt:P479 ?input_method } limit 100\n",
      "371\n",
      "SELECT ?cryptocurrency WHERE { ?cryptocurrency wdt:P414 wd:Q133051 . ?cryptocurrency rdfs:label ?label . FILTER(CONTAINS(LCASE(?label), 'neo') && ?cryptocurrency wdt:P2724 wd:Q134799) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 371\n",
      "372\n",
      "SELECT ?opposite ?named_for WHERE { wd:Q7325 wdt:P461 ?opposite . wd:Q7325 wdt:P138 ?named_for . } limit 100\n",
      "373\n",
      "SELECT ?chemical WHERE { ?chemical wdt:P4 Q12870 . ?chemical Q908624 ?velocity . ?chemical wdt:P31 Q12870 . } ORDER BY DESC(?velocity) LIMIT 1\n",
      "Request failed with status code 400\n",
      "Failed query number 373\n",
      "374\n",
      "SELECT ?result WHERE { wd:Q5 wdt:Q34790131 ?genome_size . FILTER(?genome_size > 3881796000) BIND(xsd:boolean(?genome_size > 3881796000) as ?result) } limit 100\n",
      "375\n",
      "SELECT ?drainage_basin WHERE { ?brazosRiver wdt:P2053 ?drainage_basin . FILTER (lang(?drainage_basin) = 'en') } limit 100\n",
      "376\n",
      "SELECT ?doctorLabel WHERE { wd:Q60429 wdt:P5415 ?doctor . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "377\n",
      "SELECT ?personLabel WHERE { ?person wdt:P39 wd: . ?person rdfs:label ?personLabel . FILTER(LANG(?personLabel) = 'en') } limit 100\n",
      "378\n",
      "SELECT ?itemLabel WHERE { ?item wdt:P625 ?location . FILTER(?location IN (wd:Q78879)) ?item wdt:P625 ?coordinates . FILTER(?coordinates IN (\"Point(161.364)\"^^geo:wktLiteral)) SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } } limit 100\n",
      "379\n",
      "SELECT ?court ?jurisdiction WHERE { wd:Q300950 wdt:P4884 ?court . wd:Q300950 wdt:P1001 ?jurisdiction . } limit 100\n",
      "380\n",
      "SELECT ?island WHERE { ?island Q18127 ?label . FILTER(STRSTARTS(LCASE(?label), 't') && CONTAINS(LCASE(?label), 'phantom island')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 380\n",
      "381\n",
      "SELECT ?Q1175 WHERE { ?Q10690 wdt:P190 ?Q1175 . ?Q1175 wdt:p-Country Q183 . ?Q1175 wdt:p-Type Q238101 } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 381\n",
      "382\n",
      "SELECT (COUNT(?game) as ?num_games) (SUM(?goals) as ?num_goals) WHERE { ?player wdt:P5138 wd:Q185163 . ?player wdt:P413 wd:Q280658 . ?player wdt:P735 'Just Fontaine' . ?game wdt:P5750 ?player . ?game wdt:P1351 ?goals . } limit 100\n",
      "383\n",
      "SELECT ?positionLabel WHERE { wd:Q134982 wdt:P413 ?position . SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' . ?position rdfs:label ?positionLabel } } limit 100\n",
      "384\n",
      "SELECT ?portrait WHERE { ?portrait Q1047337 Q32995247 . ?portrait Q1047337 Q2111434 } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 384\n",
      "385\n",
      "SELECT ?taxon WHERE { ?taxon wdt:P31 wd:Q12090 } limit 100\n",
      "386\n",
      "SELECT ?result WHERE { ?ss wdt:P355 ?rms . ?rms wdt:P355 ?wmd . ?ss rdfs:label ?ss_label . ?rms rdfs:label ?rms_label . ?wmd rdfs:label ?wmd_label . FILTER(LCASE(?ss_label) = LCASE('Schutzstaffel') && LCASE(?rms_label) = LCASE('Reich Main Security Office') && LCASE(?wmd_label) = LCASE('21st Waffen Mountain Division of the SS Skanderbeg')) BIND(xsd:boolean(?ss = wd:Q246) as ?result) } limit 100\n",
      "Request failed with status code 500\n",
      "Failed query number 386\n",
      "387\n",
      "SELECT ?service_branchLabel WHERE { wd:Q105941 wdt: ?consort . ?consort wdt:P241 ?service_branch . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "388\n",
      "SELECT ?date WHERE { ?supernatural wdt:P2517 ?award_category . ?award_category rdfs:label 'Favorite Pop/Rock Album'@en . ?supernatural wdt:P166 ?award . ?award wdt:P1346 wd:Q80837 . ?award wdt:P166Date ?date . } limit 100\n",
      "389\n",
      "SELECT ?organization WHERE { ?organization wdt:P159 wd:Q7164 ; wdt:p-Instance_of wd:Q484652 . } limit 100\n",
      "390\n",
      "SELECT ?population WHERE { wd:Q2181 wdt:P1082 ?population . ?population ps:P585 ?date . FILTER(?date >= \"1992-01-01T00:00:00Z\"^^xsd:dateTime && ?date <= \"1992-12-31T23:59:59Z\"^^xsd:dateTime) } limit 100\n",
      "391\n",
      "SELECT ?item WHERE { ?item rdfs:label ?label . FILTER(STRSTARTS(LCASE(?label), 'g')) } limit 100\n",
      "392\n",
      "SELECT ?position ?end_date WHERE { ?person rdfs:label \"John Major\"@en . ?person wdt:P39 ?position_statement . ?position_statement ps:P39 ?position . ?position_statement pq:P582 ?end_date . } limit 100\n",
      "393\n",
      "SELECT ?team WHERE { ?player rdfs:label 'Matthias Sindelar'@en . ?player wdt:P1358 ?points . FILTER(?points = 26.0) ?player wdt:P54 ?team . } limit 100\n",
      "394\n",
      "SELECT ?fairytaleLabel WHERE { ?fairytale Q1047337 Q4400636 . ?fairytale rdfs:label ?fairytaleLabel . FILTER(LANG(?fairytaleLabel) = 'en') FILTER(CONTAINS(LCASE(?fairytaleLabel), 'snow')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 394\n",
      "395\n",
      "SELECT ?award WHERE { wd:Q673 wdt:P166 ?award . ?award wdt:P813 ?date . FILTER(YEAR(?date) = 2009) } limit 100\n",
      "396\n",
      "SELECT (COUNT(?network) as ?count) WHERE { ?network wdt:P127 wd:Q43404 . ?network wdt:P449 ?original_network . } limit 100\n",
      "397\n",
      "SELECT ?parent WHERE { ?parent wdt:P40 wd:Q310536 . } limit 100\n",
      "398\n",
      "SELECT ?locationLabel WHERE { ?location wdt:P5037 wd:Q979 . ?location wdt:P6258 ?latitude . FILTER(?latitude = 12.5469) SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } } limit 100\n",
      "399\n",
      "SELECT ?cityLabel WHERE { wd:Q655717 wdt:P131 ?city . ?city rdfs:label ?cityLabel . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" } } limit 100\n",
      "400\n",
      "SELECT ?result WHERE { ?pokemon Q1070682 36 . ?pokemon Q24575109 Q9351 . BIND(xsd:boolean(?pokemon != Q9351) as ?result) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 400\n",
      "401\n",
      "SELECT ?detective WHERE { ?detective wdt:P31 wd:Q950639 . ?detective rdfs:label ?label . FILTER(lang(?label) = 'en') FILTER(STRSTARTS(LCASE(?label), 's')) } limit 100\n",
      "402\n",
      "SELECT ?result WHERE { ?nomination_received wdt:P1346 wd:Q30487 . ?nomination_received wdt:P1817 ?result . wd:Q1384550 ?p ?nomination_received . } limit 100\n",
      "403\n",
      "SELECT ?showrunner WHERE { ?apprentice_series wdt:P50 ?showrunner . ?showrunner wdt:P3373 ?sibling . ?sibling rdfs:label \"Robert Trump\"@en . ?apprentice_series rdfs:label \"The Apprentice\"@en . } limit 100\n",
      "404\n",
      "SELECT ?result WHERE { wd:Q12548 wdt:P1705 ?language . VALUES ?language { wd:Q7411 wd:Q9067 } BIND(xsd:boolean(?language IN (wd:Q7411, wd:Q9067)) as ?result) } limit 100\n",
      "405\n",
      "SELECT ?clothing_type WHERE { ?book wdt:P1476 \"The Silent Stars Go By\" . ?character wdt:P1441 ?book . ?character wdt:P3828 ?clothing . ?clothing wdt:P31 ?clothing_type . } limit 100\n",
      "406\n",
      "SELECT ?pronunciation WHERE { wd:Q8486 wdt:Q184377 ?pronunciation . FILTER(lang(?pronunciation) = 'ka') } limit 100\n",
      "407\n",
      "SELECT ?demigod WHERE { ?demigod wdt:P31 wd:Q466470 . ?demigod wdt:P279 wd:Q22988604 . ?demigod wdt:P3828 ?hide . FILTER regex(?hide, \"^h\", \"i\") } limit 100\n",
      "408\n",
      "SELECT (COUNT(?input) as ?cardinality) WHERE { ?input wdt: ?set . } limit 100\n",
      "409\n",
      "SELECT ?famine WHERE { ?famine Q18127 ?label . FILTER(STRSTARTS(LCASE(?label), 't') && CONTAINS(LCASE(?label), 'famine')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 409\n",
      "410\n",
      "SELECT ?director WHERE { ?office wdt:P1308 wd:Q55547556 . ?office wdt:P57 ?director . ?office wdt:P39 ?position . ?position rdfs:label ?position_label . FILTER(LCASE(?position_label) = LCASE(\"political office\")) } limit 100\n",
      "411\n",
      "SELECT ?position ?election_date WHERE { ?person rdfs:label \"Ramsay MacDonald\"@en . ?person wdt:P39 ?position_statement . ?position_statement ps:P39 ?position . ?position_statement pq:p-startDate ?election_date . } limit 100\n",
      "412\n",
      "SELECT ?disease ?diseaseLabel WHERE { ?disease wdt:P31 Q12136 . ?disease rdfs:label ?diseaseLabel . FILTER(LANG(?diseaseLabel) = 'en') FILTER(CONTAINS(LCASE(?diseaseLabel), 'syndrome') && CONTAINS(LCASE(?diseaseLabel), 'thoracic')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 412\n",
      "413\n",
      "SELECT ?tentative_list_id WHERE { ?Q737835 wdt:P2614 ?criteria . ?criteria wdt:P4171 ?tentative_list . ?tentative_list wdt:P3916 ?tentative_list_id . FILTER(CONTAINS(LCASE(?Q737835_label), LCASE(\"University of Tehran\"))) } limit 100\n",
      "414\n",
      "SELECT ?language WHERE { ?translation wdt:P629 wd:Q781898 . ?translation wdt:P655 wd:Q1710495 . ?translation wdt:P407 ?language . } limit 100\n",
      "415\n",
      "SELECT ?result WHERE { ?castle wdt:P466 ?result . ?castle rdfs:label \"Windsor Castle\"@en . ?person wdt:p-Occupation wd:Q{Q62439078} . ?person rdfs:label ?person_label . ?person wdt:p-employer ?castle . ?person_label bif:contains '\"{tenant}\"' . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 415\n",
      "416\n",
      "SELECT ?end_date WHERE { ?Q84232 ?Q28268345 ?Q518244 . ?Q518244 ?Q24575125 ?end_date . FILTER(datatype(?end_date) = xsd:dateTime) } limit 100\n",
      "417\n",
      "SELECT ?series_ordinal WHERE { ?ether wdt:P2260 9.53 . ?ether wdt:P1545 ?series_ordinal . } limit 100\n",
      "418\n",
      "SELECT ?result WHERE { wd:Q133871 wdt:P735 ?name . FILTER(lcase(?name) = lcase('normal distribution')) wd:Q133871 wdt:P61 ?discoverer . FILTER(lcase(?discoverer) = lcase('Bernhard Riemann')) BIND(xsd:boolean(lcase(?discoverer) = lcase('Bernhard Riemann')) as ?result) } limit 100\n",
      "419\n",
      "SELECT ?result WHERE { wd:Q151503 wdt:P2243 ?apoapsis . FILTER(?apoapsis = 2.126) BIND(xsd:boolean(?apoapsis = 2.126) as ?result) } limit 100\n",
      "420\n",
      "SELECT ?bourbon ?abv WHERE { ?bourbon wdt:P31 wd:Q1317341 . ?bourbon wdt:P495 wd:Q30 . ?bourbon wdt:P1628 ?abv . FILTER(lang(?abv) = 'en') . FILTER(?abv > 0) . FILTER NOT EXISTS { ?bourbon wdt:P31 wd:Q2814 } } ORDER BY ?abv LIMIT 1\n",
      "421\n",
      "SELECT ?genetic_association WHERE { ?Q12136 wdt:P2176 ?genetic_association . ?Q12136 rdfs:label 'major depressive disorder'@en . ?genetic_association Q56229865 Q81459790 . ?genetic_association Q56229865 ?determination_method . ?determination_method rdfs:label 'TAS'@en . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 421\n",
      "422\n",
      "SELECT ?end_date WHERE { wd:Q247318 p:P582 ?end_time . ?end_time ps:P582 ?end_date . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "423\n",
      "SELECT ?book_series WHERE { ?book wdt:P50 wd:Q1067 . ?book wdt:P136 ?book_series . } limit 100\n",
      "424\n",
      "SELECT ?biogeochemical_cycle WHERE { ?biogeochemical_cycle rdfs:label ?label . FILTER(CONTAINS(LCASE(?label), 'cycle') && CONTAINS(LCASE(?label), 'biogeochemical')) } limit 100\n",
      "Request failed with status code 500\n",
      "Failed query number 424\n",
      "425\n",
      "SELECT ?item WHERE { wd:Q355 ?item ?statement . FILTER(CONTAINS(LCASE(STR(?item)), 'business') || CONTAINS(LCASE(STR(?item)), 'product') || CONTAINS(LCASE(STR(?item)), 'material')) } limit 100\n",
      "426\n",
      "SELECT ?footclub WHERE { ?footclub Q18127 ?label . FILTER(STRSTARTS(LCASE(?label), 'w') && LANG(?label) = 'en') } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 426\n",
      "427\n",
      "SELECT (COUNT(?translation) as ?count) WHERE { wd:Q26833 wdt:P747 ?edition . ?edition wdt:P629 ?translation } limit 100\n",
      "428\n",
      "SELECT ?result WHERE { ?protein wdt:P688 ?gene . ?gene wdt:P703 ?species . ?protein wdt:P6800 ?sequence . FILTER(CONTAINS(?sequence, 'ipg2828')) ?protein wdt:P1542 ?result . } limit 100\n",
      "429\n",
      "SELECT ?education ?expertise WHERE { wd:Q9106 wdt:P69 ?education . wd:Q9106 wdt:P2650 ?expertise . } limit 100\n",
      "430\n",
      "SELECT ?team WHERE { ?player rdfs:label 'Peter Schmeichel'@en . ?player wdt:P54 ?team . ?player wdt:P2031 ?start . FILTER(YEAR(?start) = 1984) } limit 100\n",
      "431\n",
      "SELECT ?continent_name WHERE { wd:Q6920087 wdt:P4552 ?mountain_range . ?mountain_range wdt:p-locatedIn ?continent . ?continent rdfs:label ?continent_name . FILTER(LANG(?continent_name) = 'en') } limit 100\n",
      "432\n",
      "SELECT ?result WHERE { wd:Q994867 wdt:P3842 ?entity . ?entity rdfs:label ?label . FILTER(LCASE(?label) = LCASE('Mexico City')) BIND(xsd:boolean(?label = 'Mexico City') as ?result) } limit 100\n",
      "433\n",
      "SELECT ?grant WHERE { ?grant wdt: Q191701 . ?grant wdt:P1711 ?institution . ?institution wdt:p-instanceOf Q4671277 . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 433\n",
      "434\n",
      "SELECT ?country WHERE { ?tyumen Q22808403 ?country . ?tyumen Q3406134 ?inception . FILTER(?inception <= \"1991-12-27\"^^xsd:dateTime) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 434\n",
      "435\n",
      "SELECT ?regulator WHERE { ?regulator wdt:P128 Q27593301 . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 435\n",
      "436\n",
      "SELECT ?result WHERE { wd:Q57051271 wdt:P5520 ?toughness . FILTER(?toughness < 7.2) BIND(xsd:boolean(?toughness < 7.2) as ?result) } limit 100\n",
      "437\n",
      "SELECT ?advisorLabel WHERE { wd:Q220008 wdt:P737/wdt:P184 ?advisor . SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' . ?advisor rdfs:label ?advisorLabel } } limit 100\n",
      "438\n",
      "SELECT ?unit WHERE { ?unit wdt:P31 Q11723795 . ?unit rdfs:label ?label . FILTER(lang(?label) = 'en' && STRSTARTS(LCASE(?label), 'p') && REGEX(?label, 'temperature', 'i')) } LIMIT 1\n",
      "Request failed with status code 400\n",
      "Failed query number 438\n",
      "439\n",
      "SELECT ?temperature WHERE { ?toxaphene Q1048589 '1.65' . ?toxaphene Q11579 ?temperature . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 439\n",
      "440\n",
      "SELECT ?name WHERE { ?Q223677 rdfs:label \"John Foster Dulles\"@en . ?Q223677 wdt:P4187 ?script . ?script wdt:P898 ?alphabet . ?script rdfs:label ?name . } limit 100\n",
      "441\n",
      "SELECT ?result WHERE { wd:Q56005 wdt:P40 wd:Q21066699 . wd:Q56005 wdt:P40 wd:Q452925 . BIND(xsd:boolean(EXISTS { wd:Q56005 wdt:P40 wd:Q21066699 . wd:Q56005 wdt:P40 wd:Q452925 . }) AS ?result) } limit 100\n",
      "442\n",
      "SELECT Q26839968 WHERE { ?person Q75232720 wd:Q22686 . ?person Q30041909 Q26839968 . Q26839968 Q21503252 wd:Q51637 . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 442\n",
      "443\n",
      "SELECT ?unit WHERE { ?density_unit wdt:P881 wd:Q1077158 . ?density_unit rdfs:label ?unit . FILTER(LANG(?unit) = 'en') } limit 100\n",
      "444\n",
      "SELECT ?point_in_time WHERE { wd:Q75655 p:P69 ?degree_statement . ?degree_statement ps:P69 wd:Q798137 . ?degree_statement pq:P585 ?point_in_time . } limit 100\n",
      "445\n",
      "SELECT ?anatomical_location WHERE { ?place wdt:P1552 wd:Q2363308 . ?place wdt: ?anatomical_location . } limit 100\n",
      "446\n",
      "SELECT Q3346693 WHERE { Q3346693 Q5153528 Q207391 . Q3346693 Q21503252 Q194015 } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 446\n",
      "447\n",
      "SELECT ?date WHERE { wd:Q80976 wdt:P94 ?coat_of_arms . ?coat_of_arms wdt:P18 ?image . ?image wdt:Q3406134 ?date . FILTER(?date >= \"1947-01-01T00:00:00Z\"^^xsd:dateTime && ?date <= \"1949-12-31T23:59:59Z\"^^xsd:dateTime) } limit 100\n",
      "448\n",
      "SELECT ?person WHERE { ?film wdt:P31 Q11424 . ?film wdt:P1411 ?nomination . ?nomination wdt:P805 Q172582 . ?nomination wdt:P57 ?person . ?nomination wdt:P165 ?award . FILTER(CONTAINS(LCASE(?awardLabel), 'best sound mixing')) FILTER(CONTAINS(LCASE(?filmLabel), 'gladiator')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 448\n",
      "449\n",
      "SELECT ?team WHERE { ?team wdt:Q21503252 wd:Q1194951 . ?team Q18127 ?label . FILTER(lang(?label) = 'en') . FILTER(STRSTARTS(LCASE(?label), 't')) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 449\n",
      "450\n",
      "SELECT ?childLabel WHERE { wd:Q2349136 wdt:P3373 ?sibling . ?sibling wdt:P40 ?child . ?child rdfs:label ?childLabel . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" } } limit 100\n",
      "451\n",
      "SELECT ?role WHERE { wd:Q11881 p:P39 ?statement . ?statement ps:P39 ?position . ?position rdfs:label ?role . FILTER(CONTAINS(LCASE(?role), LCASE(\"replaced\")) && CONTAINS(LCASE(?role), LCASE(\"William Henry Harrison\"))) } limit 100\n",
      "452\n",
      "SELECT ?fifa_player_id WHERE { ?player wdt:P1469 ?fifa_player_id . ?player rdfs:label \"Stanislav Cherchesov\"@en . } limit 100\n",
      "453\n",
      "SELECT ?result WHERE { wd:Q294192 wdt:p-followed_by ?followed_by . ?followed_by wdt:p-follows wd:Q294192 . wd:Q294192 wdt:p-{{P97}} wd:Q693614 . ?followed_by rdfs:label ?result . FILTER(LANG(?result) = \"en\") } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 453\n",
      "454\n",
      "SELECT ?eraLabel WHERE { wd:Q190436 wdt:P2348 ?era . ?era wdt:P582 ?end . FILTER(?end <= \"600-01-01T00:00:00Z\"^^xsd:dateTime) SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } } limit 100\n",
      "455\n",
      "SELECT ?rankLabel WHERE { wd:Q432637 p:P410 ?militaryRankStatement . ?militaryRankStatement ps:P410 ?rank . ?militaryRankStatement pq:P580 ?startTime . ?startTime wikibase:timePrecision ?precision . FILTER(?precision <= 9) ?startTime wikibase:timeValue ?startTimeValue . ?militaryRankStatement pq:P582 ?endTime . ?endTime wikibase:timePrecision ?precision2 . FILTER(?precision2 <= 9) ?endTime wikibase:timeValue ?endTimeValue . FILTER(?startTimeValue >= \"1774-01-01T00:00:00Z\"^^xsd:dateTime && ?endTimeValue <= \"1796-12-31T23:59:59Z\"^^xsd:dateTime) SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". ?rank rdfs:label ?rankLabel. } } limit 100\n",
      "456\n",
      "SELECT ?nominationLabel WHERE { wd:Q28470 wdt:P1411 ?nomination . ?nomination wdt:P166 ?award . FILTER(CONTAINS(STR(?award), '12th Academy Awards')) SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' . } } limit 100\n",
      "457\n",
      "SELECT ?crossref_funder_id WHERE { ?Q148584 wdt:P3153 ?crossref_funder_id . FILTER(REGEX(STR(?Q148584Label), 'National Museum of American History', 'i')) } limit 100\n",
      "458\n",
      "SELECT ?siruta_code WHERE { ?Q79808 wdt:P843 ?siruta_code . FILTER(LCASE(STR(?Q79808)) = LCASE('Constanta')) } limit 100\n",
      "459\n",
      "SELECT ?brockhaus_id WHERE { ?Q298 wdt:P5019 ?brockhaus_id . ?Q298 rdfs:label 'Chile'@en . } limit 100\n",
      "460\n",
      "SELECT ?cityLabel WHERE { ?city Q21503252 Q515 . ?city Q18127 ?cityLabel . FILTER(Q1860(?cityLabel) = 'en') FILTER(CONTAINS(Q8185162(?cityLabel), 'worms')) ?city Q22808403 Q6837 . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 460\n",
      "461\n",
      "SELECT ?date WHERE { ?person wdt:P26 wd:Q46109451 . ?person wdt:P735 'Roman Abramovich' . ?person wdt:P2842 ?marriage . ?marriage wdt:P813 ?date . } limit 100\n",
      "462\n",
      "SELECT ?result WHERE { wd:Q190230 wdt:P2661 ?target_interest_rate . FILTER(?target_interest_rate = 5.25) BIND(xsd:boolean(?target_interest_rate = 5.25) as ?result) } limit 100\n",
      "463\n",
      "SELECT ?result WHERE { wd:Q19190 wdt:P106 ?occupation . FILTER(?occupation IN (wd:Q33999, wd:Q970153)) BIND(xsd:boolean(?occupation IN (wd:Q33999, wd:Q970153)) as ?result) } limit 100\n",
      "464\n",
      "SELECT ?result WHERE { wd:Q163286 ?relatives ?person . ?person rdfs:label \"Rick Cosnett\"@en . BIND(xsd:boolean(?relatives != wd:Q0) as ?result) } limit 100\n",
      "465\n",
      "SELECT ?item WHERE { ?item wdt:P248 wd:Q1085823 } limit 100\n",
      "466\n",
      "SELECT ?id WHERE { ?person wdt:P4368 ?id . ?person rdfs:label \"Brett Favre\"@en . } limit 100\n",
      "467\n",
      "SELECT ?area_of_workLabel WHERE { wd:Q28792298 wdt:P101 ?area_of_work . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". } } limit 100\n",
      "468\n",
      "SELECT ?gcatholic_id WHERE { wd:Q84090 wdt:P2971 ?gcatholic_id . } limit 100\n",
      "469\n",
      "SELECT ?team (COUNT(?match) AS ?num_matches) WHERE { ?player rdfs:label \"Roger Milla\"@en . ?player wdt:P54 ?team . ?player wdt:P1350 ?match . } GROUP BY ?team limit 100\n",
      "470\n",
      "SELECT ?end_date WHERE { ?marriage wdt:P26 Q4616 ; wdt:P26 Q57846887 ; wdt:P582 ?end_date . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 470\n",
      "471\n",
      "SELECT ?kinopoisk_id WHERE { ?person wdt:P2604 ?kinopoisk_id . ?person rdfs:label \"Stanley Donen\"@en . } limit 100\n",
      "472\n",
      "SELECT ?diseaseLabel WHERE { ?disease wdt:P31 Q12136 . ?disease rdfs:label ?diseaseLabel . FILTER(lang(?diseaseLabel) = 'en' && STRSTARTS(LCASE(?diseaseLabel), 'y')) } LIMIT 1\n",
      "Request failed with status code 400\n",
      "Failed query number 472\n",
      "473\n",
      "SELECT ?result WHERE { ?item wdt:P3018 wd:Q128011 . ?item wdt:P3018Continent wd:Q49 . ?item wdt:P821 ?result } limit 100\n",
      "474\n",
      "SELECT ?orderLabel WHERE { wd:Q44281 wdt:P140 ?order . ?order rdfs:label ?orderLabel . FILTER(LANG(?orderLabel) = 'en') } limit 100\n",
      "475\n",
      "SELECT ?productLabel WHERE { ?product wdt:P31 wd:Q40231 . ?product wdt:P279* Q542929 . ?product wdt:P366 ?papermaking . ?papermaking wdt:P279* Q335415 . ?product wdt:P186 ?bleach . ?bleach wdt:P279* Q904 . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\". ?product rdfs:label ?productLabel. } } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 475\n",
      "476\n",
      "SELECT ?event WHERE { ?ship rdfs:label \"SS Naronic\"@en . ?ship wdt:P793 ?event . } limit 100\n",
      "477\n",
      "SELECT ?result WHERE { wd:Q299595 p:Q_ID ?org . ?org p:Q_ID ?position . ?position rdfs:label \"chairwoman\"@en . ?position wdt:P108 ?working_for . ?working_for rdfs:label \"working for\"@en . } limit 100\n",
      "478\n",
      "SELECT ?student WHERE { ?student wdt:P184 wd:Q200101 . } limit 100\n",
      "479\n",
      "SELECT ?location WHERE { wd:Q18118720 wdt:P190 wd:Q2680952 . wd:Q18118720 wdt:P291 ?location . } limit 100\n",
      "480\n",
      "SELECT Q82794 WHERE { ?region wdt:P276 wd:Q1197 . ?region wdt:P2547 ?coastline . ?coastline rdfs:label \"coast of Lower Saxony\"@en . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" } } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 480\n",
      "481\n",
      "SELECT (COUNT(Q5113984) as Q3519259) WHERE { ?Q210402 Q212980 Q5113984 . Q5113984 Q21503252 Q5113984 . } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 481\n",
      "482\n",
      "SELECT ?result WHERE { ?city wdt: ?population . ?city wdt:P17 wd:Q1227 . ?city wdt:P131 true . BIND(xsd:boolean(?population > 0) as ?result) } limit 100\n",
      "483\n",
      "SELECT ?position WHERE { ?person1 p:replaces wd:Q1700617 . ?person2 p:replacedBy ?person1 . ?person2 wdt:P413 ?position . ?person2 rdfs:label \"William Carmichael\"@en . } limit 100\n",
      "484\n",
      "SELECT ?food_or_dish WHERE { ?food_or_dish rdfs:label ?label . FILTER(lang(?label) = 'en') FILTER(CONTAINS(LCASE(?label), 'torta')) ?food_or_dish wdt:P31/wdt:Q61268336* wd:Q2095 } limit 100\n",
      "485\n",
      "SELECT ?particle_type WHERE { ?particle wdt:P2222 ?gyromagnetic_ratio . ?particle wdt:P31 ?particle_type . FILTER(?gyromagnetic_ratio = (SELECT MAX(?gyro) WHERE { ?p wdt:P2222 ?gyro . })) } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 485\n",
      "486\n",
      "SELECT ?genreLabel WHERE { ?genre Q1047337 Q223393 . ?genre rdfs:label ?genreLabel . FILTER(CONTAINS(LCASE(?genreLabel), 'vita') && LANG(?genreLabel) = 'en') } limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 486\n",
      "487\n",
      "SELECT ?equation WHERE { ?horsepower_unit wdt:P366 ?usage . ?usage wdt:P2534 ?equation . FILTER(CONTAINS(LCASE(?equation), LCASE(\"horsepower\"))) } limit 100\n",
      "488\n",
      "SELECT ?parent_company WHERE { ?person wdt:P1416 wd:Q258385 . ?person wdt:P749 ?parent_company . } limit 100\n",
      "489\n",
      "SELECT ?languageLabel WHERE { wd:Q17872 wdt:P1705 ?language . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "490\n",
      "SELECT ?text_input WHERE { wd:Q108585133 wdt:Q29654788 ?emoji . ?emoji wdt:Q8819 ?text_input . FILTER(lang(?text_input) = 'en') } limit 100\n",
      "491\n",
      "SELECT ?languageLabel WHERE { wd:Q158772 wdt:P103 ?language . SERVICE wikibase:label { bd:serviceParam wikibase:language 'en' . } } limit 100\n",
      "492\n",
      "SELECT ?personLabel WHERE { ?person wdt:P31 wd:Q5 . ?person wdt:P108 wd:Q371712 . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" } } LIMIT 1\n",
      "493\n",
      "SELECT ?composition WHERE { ?composer rdfs:label \"Dionysus\"@en . ?composition wdt:P86 ?composer . } limit 100\n",
      "494\n",
      "SELECT ?description WHERE { ?Q39503 rdfs:label 'Artemis'@en . ?Q39503 schema:description ?description . FILTER(LANG(?description) = 'en') } limit 100\n",
      "495\n",
      "SELECT ?position WHERE { wd:Q56854980 wdt:P413 ?position . FILTER NOT EXISTS { wd:Q167561 wdt:P413 ?position } } limit 100\n",
      "496\n",
      " limit 100\n",
      "Request failed with status code 400\n",
      "Failed query number 496\n",
      "497\n",
      "SELECT ?award WHERE { ?album wdt:P31 wd:Q482994 . ?album rdfs:label \"Cream\"@en . ?album wdt:P571 ?date . FILTER(?date >= \"1983-0-0\"^^xsd:dateTime) ?album wdt:P166 ?award . ?award rdfs:label \"p-{award_won}\"@en . } limit 100\n",
      "498\n",
      "SELECT ?result WHERE { ?place wdt:P625 ?coordinates . ?place wdt:P1344 wd:Q162362 . FILTER(?coordinates > ?Q58192337) BIND(xsd:boolean(?coordinates > ?Q58192337) as ?result) } limit 100\n",
      "499\n",
      "SELECT ?positionLabel WHERE { ?person rdfs:label \"Jacinda Ardern\"@en . ?person wdt:P413 ?position . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } } limit 100\n",
      "CPU times: user 12 s, sys: 1.85 s, total: 13.8 s\n",
      "Wall time: 23min 34s\n"
     ]
    }
   ],
   "source": [
    "%%time\n",
    "v = validate_queries(queries)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 72,
   "id": "dd67aabb-1cf6-49e1-9fe9-750833d10e7b",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "500"
      ]
     },
     "execution_count": 72,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(v)\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 73,
   "id": "bd49f870-3d9b-4177-be18-1450ef9e6a1d",
   "metadata": {},
   "outputs": [],
   "source": [
    "v_df = pd.DataFrame(v)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 74,
   "id": "ba432f64-b339-4f3f-af43-0416510f0e0e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "384"
      ]
     },
     "execution_count": 74,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "len(v_df[v_df[0] == 'Pass'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 83,
   "id": "c44a2670-cc31-4846-8dcb-91a9eac32fa9",
   "metadata": {},
   "outputs": [],
   "source": [
    "q = 'SELECT ?facilityLabel WHERE { ?defensive_wall wdt:P846 ?facility . SERVICE wikibase:label { bd:serviceParam wikibase:language \"en\" . } }'"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 75,
   "id": "4f2059d4-2f7e-41fd-9ada-ebd6c72b55df",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<style scoped>\n",
       "    .dataframe tbody tr th:only-of-type {\n",
       "        vertical-align: middle;\n",
       "    }\n",
       "\n",
       "    .dataframe tbody tr th {\n",
       "        vertical-align: top;\n",
       "    }\n",
       "\n",
       "    .dataframe thead th {\n",
       "        text-align: right;\n",
       "    }\n",
       "</style>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>0</th>\n",
       "      <th>1</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>Pass</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>Pass</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>Pass</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>Fail</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>Pass</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>495</th>\n",
       "      <td>Pass</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>496</th>\n",
       "      <td>Fail</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>497</th>\n",
       "      <td>Pass</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>498</th>\n",
       "      <td>Pass</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>499</th>\n",
       "      <td>Pass</td>\n",
       "      <td>0</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>500 rows × 2 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "        0  1\n",
       "0    Pass  0\n",
       "1    Pass  0\n",
       "2    Pass  0\n",
       "3    Fail  0\n",
       "4    Pass  0\n",
       "..    ... ..\n",
       "495  Pass  0\n",
       "496  Fail  0\n",
       "497  Pass  0\n",
       "498  Pass  0\n",
       "499  Pass  0\n",
       "\n",
       "[500 rows x 2 columns]"
      ]
     },
     "execution_count": 75,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "v_df"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 76,
   "id": "da90dadb-7f81-4915-b4af-93a85bad31c8",
   "metadata": {},
   "outputs": [
    {
     "ename": "TypeError",
     "evalue": "string indices must be integers",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mTypeError\u001b[0m                                 Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[76], line 1\u001b[0m\n\u001b[0;32m----> 1\u001b[0m \u001b[43mtranslator\u001b[49m\u001b[43m(\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mWhat is the product with the lowest consumption rate per capita whose has part is paraffin wax?\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m)\u001b[49m\n",
      "Cell \u001b[0;32mIn[18], line 7\u001b[0m, in \u001b[0;36mtranslator\u001b[0;34m(question)\u001b[0m\n\u001b[1;32m      5\u001b[0m \u001b[38;5;28;01mexcept\u001b[39;00m \u001b[38;5;167;01mException\u001b[39;00m:\n\u001b[1;32m      6\u001b[0m     query_template \u001b[38;5;241m=\u001b[39m \u001b[38;5;124m\"\u001b[39m\u001b[38;5;124m\"\u001b[39m \n\u001b[0;32m----> 7\u001b[0m query \u001b[38;5;241m=\u001b[39m \u001b[43mresolve_query_template\u001b[49m\u001b[43m(\u001b[49m\u001b[43mquery_template\u001b[49m\u001b[43m)\u001b[49m\n\u001b[1;32m      8\u001b[0m \u001b[38;5;28;01mreturn\u001b[39;00m query\n",
      "Cell \u001b[0;32mIn[16], line 2\u001b[0m, in \u001b[0;36mresolve_query_template\u001b[0;34m(t)\u001b[0m\n\u001b[1;32m      1\u001b[0m \u001b[38;5;28;01mdef\u001b[39;00m \u001b[38;5;21mresolve_query_template\u001b[39m(t):\n\u001b[0;32m----> 2\u001b[0m     vocab_items \u001b[38;5;241m=\u001b[39m [(v[\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mitem_tag\u001b[39m\u001b[38;5;124m\"\u001b[39m], v[\u001b[38;5;124m\"\u001b[39m\u001b[38;5;124mitem_label_quesses\u001b[39m\u001b[38;5;124m\"\u001b[39m]) \u001b[38;5;28;01mfor\u001b[39;00m v \u001b[38;5;129;01min\u001b[39;00m \u001b[43mt\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[38;5;124;43mvocabulary\u001b[39;49m\u001b[38;5;124;43m\"\u001b[39;49m\u001b[43m]\u001b[49m]\n\u001b[1;32m      3\u001b[0m     resolved_vocabulary \u001b[38;5;241m=\u001b[39m {item_tag: vocab_lookup(item_label_quesses[\u001b[38;5;241m0\u001b[39m], item_tag\u001b[38;5;241m=\u001b[39mitem_tag) \u001b[38;5;28;01mfor\u001b[39;00m item_tag, item_label_quesses \u001b[38;5;129;01min\u001b[39;00m vocab_items}\n\u001b[1;32m      4\u001b[0m     query \u001b[38;5;241m=\u001b[39m t[\u001b[38;5;124m'\u001b[39m\u001b[38;5;124mquery_template\u001b[39m\u001b[38;5;124m'\u001b[39m]\n",
      "\u001b[0;31mTypeError\u001b[0m: string indices must be integers"
     ]
    }
   ],
   "source": [
    "translator(\"What is the product with the lowest consumption rate per capita whose has part is paraffin wax?\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 77,
   "id": "152f3fa5-b4b9-4c55-8ac7-a3a7fcf156cb",
   "metadata": {},
   "outputs": [],
   "source": [
    "question = \"What is the product with the lowest consumption rate per capita whose has part is paraffin wax?\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 87,
   "id": "928360e2-2225-4c92-85c5-49c2140beb05",
   "metadata": {},
   "outputs": [],
   "source": [
    "question = \"\"\"\n",
    "When did James Thomas Farrell receive the St. Louis Literary Award?\",\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 89,
   "id": "654c1819-b17f-47f0-9f17-5f97eb3aef53",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{\n",
      "  \"query_template\": \"SELECT ?date WHERE { wd:q-JamesThomasFarrell wdt:p-Award ?award . ?award wdt:p-AwardReceivedDate ?date . ?award wdt:p-AwardReceived ?received . ?received rdfs:label \\\"St. Louis Literary Award\\\"@en }\",\n",
      "  \"vocabulary\": [\n",
      "    {\n",
      "      \"item_tag\": \"q-JamesThomasFarrell\",\n",
      "      \"item_label_quesses\": [\"James Thomas Farrell\", \"Farrell, James Thomas\"]\n",
      "    },\n",
      "    {\n",
      "      \"item_tag\": \"p-Award\",\n",
      "      \"item_label_quesses\": [\"Award\", \"Prize\", \"Honour\"]\n",
      "    },\n",
      "    {\n",
      "      \"item_tag\": \"p-AwardReceivedDate\",\n",
      "      \"item_label_quesses\": [\"Award received date\", \"Date of receiving award\", \"Date received\"]\n",
      "    },\n",
      "    {\n",
      "      \"item_tag\": \"p-AwardReceived\",\n",
      "      \"item_label_quesses\": [\"Award received\", \"Receiving award\", \"Award recipient\"]\n",
      "    }\n",
      "  ]\n",
      "}\n"
     ]
    }
   ],
   "source": [
    "query_template_json = chain.run(question)\n",
    "print(query_template_json)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 100,
   "id": "3eb79100-7b29-4540-9fc9-28cbc13a1b20",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "No property found for 'Award received date'\n"
     ]
    },
    {
     "data": {
      "text/plain": [
       "'SELECT ?date WHERE { wd:Q1371154 wdt:P166 ?award . ?award wdt: ?date . ?award wdt:P166 ?received . ?received rdfs:label \"St. Louis Literary Award\"@en }'"
      ]
     },
     "execution_count": 100,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "query_template = json.loads(query_template_json)\n",
    "resolve_query_template(query_template)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 97,
   "id": "638ac4ba-2230-4634-bd96-6911b0f24df6",
   "metadata": {},
   "outputs": [],
   "source": [
    "def resolve_query_template(t):\n",
    "    vocab_items = [(v[\"item_tag\"], v[\"item_label_quesses\"]) for v in t[\"vocabulary\"]]\n",
    "    vocab_items = sorted(vocab_items, key=lambda x: x[1], reverse=True)\n",
    "    print(vocab_items)\n",
    "    resolved_vocabulary = {item_tag: vocab_lookup(item_label_quesses[0], item_tag=item_tag) for item_tag, item_label_quesses in vocab_items}\n",
    "    print(resolved_vocabulary)\n",
    "    query = t['query_template']\n",
    "    for item_tag, item_id in resolved_vocabulary.items():\n",
    "        query = query.replace(item_tag, item_id)\n",
    "    result = query\n",
    "    return result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 85,
   "id": "39fbaed2-28d7-48bc-8932-46041450f408",
   "metadata": {},
   "outputs": [
    {
     "ename": "TypeError",
     "evalue": "string indices must be integers",
     "output_type": "error",
     "traceback": [
      "\u001b[0;31m---------------------------------------------------------------------------\u001b[0m",
      "\u001b[0;31mTypeError\u001b[0m                                 Traceback (most recent call last)",
      "Cell \u001b[0;32mIn[85], line 1\u001b[0m\n\u001b[0;32m----> 1\u001b[0m \u001b[43mquery_template\u001b[49m\u001b[43m[\u001b[49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[38;5;124;43mvocabulary\u001b[39;49m\u001b[38;5;124;43m'\u001b[39;49m\u001b[43m]\u001b[49m\n",
      "\u001b[0;31mTypeError\u001b[0m: string indices must be integers"
     ]
    }
   ],
   "source": [
    "query_template['vocabulary']"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 86,
   "id": "d7c73ed8-4424-4608-9b37-0819eee819a5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "False"
      ]
     },
     "execution_count": 86,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "'limit' in q.lower()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "cc41ae88-2e53-4363-9878-28b26430cb1e",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "conda210",
   "language": "python",
   "name": "conda210"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.16"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
